Repository: midigurdy/mg-docs
Catalog: locales/*/LC_MESSAGES/Adjusting_the_Keyboard.po
Languages: fr

source: Adjusting the Keyboard
fr: Réglages du Clavier

source: The MidiGurdy allows you to adjust some of the mechanical aspects of the keyboard in order to match them to your liking or to recreate some of the playing feel of your acoustic hurdy-gurdy.
fr: La MidiGurdy vous permet de régler quelques aspects mécaniques du clavier afin de les mettre à votre "goût", ou de recréer les mêmes sensations de jeu que ceux sur votre vielle à roue acoustique.

source: There are two properties you can change:
fr: Deux propriétés du clavier sont réglables :

source: the tension of the string inside the tangent box
fr: la tension de la corde à l'intérieur du clavier

source: the travel of the keys before hitting the string.
fr: le trajet des touches avant qu'elles ne viennent en contact avec la corde.

source: Opening and closing the tangent box lid
fr: Ouvrir et fermer le couvercle du clavier

source: Open up the tangent box lid by grabbing the protruding end on the side towards the wheel cover. Push or pull it upwards with a little force to separate it from the magnets holding it in place. The lid is connected to the body via a small cable, so please make sure you don’t pull the lid away too far without unplugging the cable.
fr: Ouvrir le couvercle du clavier en attrapant la partie qui dépasse, située vers le couvre-roue. Tirer ou pousser le couvercle vers le haut sans trop forcer afin de le séparer des aimants qui le maintiennent en place. Le couvercle est connecté au corps de la MidiGurdy par un petit câble, attention de ne pas débrancher ce dernier lors d'une ouverture trop brusque.

source: Once you've made your adjustments, replace the lid and the magnets should make it snap into place.
fr: Une fois les réglages terminés, remettre le couvercle en position, les aimants devraient produire un claquement typique quand il reprend sa place.

source: Changing the string tension
fr: Changer la tension de corde

source: Location of the string tension tuner
fr: Localisation du syntoniseur de tension de corde

source: Inside the tangent box you see the instrument tuner near the front of the instrument. Turn the knob on the tuner clockwise to increase the string tension or anti-clockwise to decrease the tension.
fr: Dans la boîtier il y a le syntoniseur de l'instrument près de la "tête" de celui-ci. Tourner le bouton sur le syntoniseur vers la droite pour augmenter la tension de corde ou vers la gauche pour la diminuer.

source: Always make small adjustments
fr: Toujours procéder par de petits ajustements

source: Always make only small adjustments to the string tension and check if the playing feel has changed to your liking. Increasing the tension too much might damage the instrument!
fr: Toujours procéder par de petits ajustements et contrôler au fur et à mesure que la sensation de jeu vous convienne. Une trop grande tension de corde pourrait endommager l'instrument !

source: Changing the key travel
fr: Changer la course des touches

source: Location of the key sensor screws
fr: Emplacement des vis du capteur de clé

source: The key travel can be adjusted for each individual key by changing the position of the key sensor.
fr: La course de chaque touche peut être réglée individuellement en changeant la position du capteur de touche.

source: Use a small Phillips screwdriver to loosen the screw holding the sensor in place a little bit.
fr: Utiliser un petit tournevis Phillips pour dévisser légèrement la vis qui maintient le capteur.

source: Use the screwdriver to shift the screw and attached key sensor forwards or backwards. You might need to use a little force to move it the first time. Pressing down on the screw or lifting it with a fingernail might help to get it to move more freely.
fr: Utiliser le tournevis pour déplacer la vis et le capteur de touche correspondant en avant ou en arrière. Il ne faut par forcer pour les déplacer la première fois. Appuyer sur la vis ou la soulever à l'aide d'un ongle devrait faciliter ces mouvements.

source: Once you have positioned the key sensor, tighten the screw again, but only very lightly.
fr: Une fois le capteur en bonne position, il suffit de revisser, mais toujours avec délicatesse.

source: Only loosen the screws
fr: Simplement desserrer les vis

source: Only unscrew the key sensor a small amount until you can move it. Do not unscrew it all the way, otherwise the key sensor might drop away from the key, making it very difficult to get it back into place!
fr: Il faut très légèrement dévisser le capteur, jusqu'à ce qu'il bouge un peu. Attention de ne pas complètement le dévisser, la vis pourrait sortir de la touche, et ce serait une galère pour la remettre en place !

source: Do not tighten with a lot of force
fr: Ne pas revisser avec force

source: Only tighten the screws of the key sensor with a small amount of force! Ideally you should use a screwdriver with a thin handle to turn the screw, reducing the force you can apply to the screw. The key sensor will hold in place even when the screw is not very tightly secured!
fr: Toujours resserrer les vis avec délicatesse. Dans l'idéal il faudrait utiliser un tournevis à manche fin, ce qui réduirait la force appliquée sur la vis. Le capteur de touche restera en place même si la vis n'est pas fermement resserrée !

source: Recalibration
fr: Recalibrage

source: The key sensors are very sensitive to the amount of force with which they are pressed against the string. This means that larger changes to the string tension or a significant change in key travel might make it necessary to recalibrate the keyboard sensors.
fr: Les capteurs de touche sont très sensibles à la force appliquée quand il sont pressés sur la corde. Cela signifie que des changements importants affectant la tension de corde ou la course des touches rend nécessaire un recalibrage des capteurs de touches.

source: To recalibrate the keyboard, please connect the MidiGurdy to a computer to access the Web-Interface. Then choose the recalibration function from the Advanced menu.
fr: Pour recalibrer le clavier, merci de connecter la MidiGurdy à un ordinateur pour accéder à l'Interface Web. Puis choisir la fonction "recalibrage" (recalibration) dans le Menu Avancé (Advanced Menu).
