Repository: midigurdy/mg-docs
Catalog: locales/*/LC_MESSAGES/Connections.po
Languages: fr

source: Connections
fr: Connexions

source: The connectors at the front of the MidiGurdy connect the instrument with all external components and devices.
fr: Les connecteurs sur l’avant de la MidiGurdy permettent de relier l'instrument aux composants et matériels externes.

source: Power Supply
fr: Alimentation électrique (Power supply)

source: The MidiGurdy power connections
fr: Connexions électriques de la MidiGurdy

source: The MidiGurdy can be powered from three different sources:
fr: La MidiGurdy peut être alimentée en électricité par trois sources différentes :

source: By inserting eight AA / R6 / Mignon batteries or rechargeable batteries
fr: Par huit piles AA / R6 / Mignon ou des piles rechargeables

source: By attaching the included 5V power supply
fr: Au moyen de l'adaptateur 5V fourni (5V Power Adapter)

source: By attaching the USB-B port to another USB device like a computer, laptop or phone charger via a suitable USB cable
fr: Au moyen d'un câble adéquat la reliant par le port USB-B à un équipement comme un ordinateur, un ordinateur portable ou un chargeur de téléphone

source: All three power sources can also be connected at the same time. The MidiGurdy will always choose the best source available and show the currently selected source in the top right corner of the display.
fr: Les trois sources d'alimentation peuvent être connectées en même temps. La MidiGurdy sélectionnera toujours la meilleure source disponible et on pourra voir sur l'écran en haut à droite laquelle est active.

source: When the 5V power supply is connected, the instrument will always be powered via this source and will draw no power from the batteries or the USB port. When powered via USB and batteries, the instrument will mainly draw power from the USB connection and only fall back to the batteries if the USB connection cannot supply enough current.
fr: Quand l'adaptateur 5V est connecté, l'instrument sera toujours alimenté au moyen de cette source, et il n'y aura pas d’icône de "batteries" ou de port USB représenté. Quand la source électrique est fournie au moyen du port USB ou des piles ("batteries"), l’icône présente sur l'écran sera celle correspondant à USB, et laissera place à l’icône représentant les piles si la connexion USB ne peut pas fournir l'électricité suffisante au bon fonctionnement de la MidiGurdy.

source: Concerning Batteries
fr: À propos des Piles

source: The MidiGurdy is designed to be used with eight AA batteries (also called R6 or Mignon cells). Either primary (disposable) or secondary (rechargeable) cells can be used. We recommend high-capacity 2500mAh NiMH rechargeable batteries, which will give you an estimated 10 – 12 hours of solid playing time.
fr: La MidiGurdy est prévue pour utiliser huit piles de type AA (aussi nommées R6 ou Mignon). Les piles jetables comme les piles rechargeables peuvent être employées. En ce qui concerne les piles rechargeables nous recommandons celles de haute capacité : 2500 Ah NiMH, dont la durée d'action estimée sera de 10 à 12 heures de temps de jeu.

source: The MidiGurdy does not contain a battery charger. If you use rechargeable batteries (which we highly recommend), you will need an external charger to bring them back to charge.
fr: La MidiGurdy ne contient pas de chargeur de piles. Si vous utilisez des piles rechargeables (ce que nous préconisons fortement) vous aurez besoin d'un chargeur externe pour les recharger.

source: Always replace all batteries when inserting fresh batteries into the instrument, never replace only individual cells.
fr: Il faut toujours remplacer la totalité des piles quand c'est nécessaire, et ne jamais remplacer une seule des piles sur l'ensemble des huit.

source: Please check the polarity of the batteries carefully before inserting them into the instrument!
fr: Il est nécessaire de remplacer les piles en respectant scrupuleusement la polarité indiquée !

source: Headphones
fr: Casque audio (Headphones)

source: Connecting headphones to the MidiGurdy
fr: Connexion du casque audio à la MidiGurdy

source: The MidiGurdy outputs all sound via the 6,3mm (¼ inch) stereo jack connector. Simply insert the headphones and adjust the volume of the instrument to comfortable levels. See :ref:`volume-menus` on how to change the volume.
fr: La sortie des sons de la MidiGurdy se fait grâce à un jack stéréo 6.3 mm (1/4 de pouce). Il suffit d'insérer le jack du casque dans la prise dédiée et de régler le volume de l'instrument pour une écoute confortable. Pour ce réglage voir la section :ref:`volume-menus`.

source: Other Sound Equipment
fr: Autres Équipements Audio

source: Connecting other sound equipment
fr: Connexion à d’autres matériels de son

source: To connect the MidiGurdy to an amplifier, a mixing console, recording device or other sound equipment, please use the supplied Y-cable and breakout box ("DI-box"). Connect the single stereo plug of the Y-cable to the headphone jack of the MidiGurdy and the two mono plugs to the ports on the breakout box marked "Input 1" and "Input 2". Then connect one or both “Output” ports of the breakout box to the amplifier or other sound equipment.
fr: Pour connecter la MidiGurdy à un amplificateur, une table de mixage, un équipement d'enregistrement, ou tout autre matériel de son, merci d'utiliser le câble en Y et la DI-box fournis. Connecter la partie stéréo du câble en "Y" (jack stéréo) sur la sortie "casque" de la vielle et les deux jacks mono sur les entrées de la DI-box notées "Input1" et "Input 2". Puis relier l'un ou les deux sorties de la DI-box notées "Output 1" et "Output 2" à l'amplificateur ou aux autres matériels.

source: USB Data Connection to Computer or Tablet
fr: Connexion de données vers ordinateur ou tablette par prise USB

source: To connect the MidiGurdy with a desktop computer or tablet please use a USB-A to USB-B cable, as used for most USB printers. (This cable is not shipped with the instrument and needs to be purchased separately.)
fr: Pour connecter la MidiGurdy à un ordinateur, une tablette ou un autre matériel merci d'utiliser un câble USB-A / USB-B, identique à ceux utilisés pour la majeur partie des imprimantes. (Ce câble n'est pas livré avec l'instrument et doit être acheté séparément.)

source: Once connected, the MidiGurdy will act as two separate USB devices via this connection:
fr: Une fois connectée, la MidiGurdy fonctionnera comme avec deux équipements différents par cette connexion :

source: as a USB network card
fr: comme un adaptateur de réseau USB

source: as a USB-MIDI controller
fr: comme un contrôleur USB-MIDI

source: Both functions use a standard implementation and should therefore work on any modern computer or tablet without installing additional drivers.
fr: Les deux fonctions utilisent une mise en œuvre (implementation) standard et pourront donc agir sur n'importe quel ordinateur ou tablette moderne sans avoir à installer des pilotes complémentaires.

source: If your device provides enough power via the USB port, the MidiGurdy will use this connection to power itself, unless the 5V power supply (see above) is plugged in.
fr: Nota-Bene : si l'équipement connecté fournit assez de courant par le port USB, la MidiGurdy utilisera cette connexion pour son alimentation électrique, sauf si l'adaptateur 5V. (voir ci-dessus) est branché.

source: For more information on how to use the MidiGurdy via the USB connection, please refer to section :ref:`web-interface`.
fr: Pour plus d'information sur la façon d'utiliser la MidiGurdy au moyen d'une connexion USB, se reporter à la section :ref:`web-interface`.

source: For more information on how to use the instrument as a MIDI device with your computer or tablet, please see section :ref:`midi`.
fr: Pour plus d'information sur la façon d'utiliser la MidiGurdy au moyen d'une connexion MIDI, se reporter à la section :ref:`midi`.

source: External Synthesizer via USB-MIDI Connection
fr: Connexion à un synthétiseur externe par prise USB-MIDI

source: The MidiGurdy provides a standard USB-MIDI connection via the USB-B port and can therefore be used to control external synthesizers or other MIDI capable devices that have a USB-MIDI interface.
fr: La MidiGurdy est équipée d'une connexion standard USB-MIDI via le port USB-B et peut donc être utilisée pour contrôler des synthétiseurs externes ou d'autres équipements MIDI possédant un interface USB-MIDI.

source: Simply attach the MidiGurdy with a suitable USB-A to USB-B cable as shown in the picture above.
fr: Il suffit de relier la MidiGurdy au moyen d'un câble USB-A / USB-B comme montré ci-dessus.

source: The USB-MIDI connection setup can be configured via the web interface of the MidiGurdy. Please see the section :ref:`web-interface` for more details.
fr: L'installation de la connexion USB-MIDI peut se faire par l'Interface Web. Merci de consulter la section :ref:`web-interface` pour plus de détails.
