Repository: midigurdy/mg-docs
Catalog: locales/*/LC_MESSAGES/Getting_to_know_the_MidiGurdy.po
Languages: fr

source: Getting to know the MidiGurdy
fr: Découvrir la MidiGurdy

source: In many ways the MidiGurdy works very similar to other hurdy-gurdies, but there are a few differences that you should be aware of. The MidiGurdy also offers many functions that you won‘t find on an acoustic instrument, which this manual will explain in detail.
fr: La vielle à roue MidiGurdy fonctionne de bien des façons comme les autres vielles à roue, mais il y a quelques différences que vous devriez connaître. La MidiGurdy offre également de nombreuses fonctions que vous ne trouverez pas sur un instrument acoustique, que ce manuel vous expliquera en détail.

source: In this section we will explore the mechanical features of the instrument and learn about the user controls and the connectors available on the MidiGurdy.
fr: Dans cette section, nous allons explorer les caractéristiques mécaniques de l'instrument et en apprendre davantage sur les commandes utilisateur et les connecteurs disponibles sur la MidiGurdy.

source: Mechanical Features
fr: Caractéristiques mécaniques

source: The mechanical features of the MidiGurdy
fr: Caractéristiques mécaniques de la MidiGurdy

source: (1) Keyboard
fr: (1) Le Clavier

source: The keyboard of the MidiGurdy works like most hurdy-gurdies and uses gravity for the keys to fall back into their original position. This requires you to tilt the instrument forward while playing.
fr: Le clavier de la MidiGurdy fonctionne comme celui des vielles à roue acoustiques, la gravitation permet aux touches de revenir en position basse après qu'elles aient été actionnées, ce qui nécessite d'incliner l'instrument vers l'avant lorsque l'on en joue.

source: (2) Tangent box lid
fr: (2) Couvercle du clavier

source: The tangent is covered by a wooden lid that is held in place using four magnets.
fr: Le couvercle en bois recouvre les sautereaux et est maintenu en place par 4 aimants.

source: (3) Crank
fr: (3) Manivelle

source: The crank also works like you would expect from a hurdy-gurdy. You can turn it forwards, backwards, shake it and use it to sound the trompette by giving shorter or longer impulses while turning. The turning speed also affects the volume of the instrument.
fr: La manivelle fonctionne aussi comme sur une vielle "classique". Il est possible de la manœuvrer vers l'avant, l'arrière, la faire vibrer et impulser des à-coups pour faire sonner le "chien" ("trompette"). La vitesse de rotation a aussi une incidence sur le volume sonore de l'instrument.

source: (4) Wheel Cover
fr: (4) Couvercle de la roue

source: The wheel cover can be lifted by grabbing it on both sides and simply lifting it upwards with a little force. Once the cover is removed, you can grab the wheel to attach or remove the crank. To close the cover again, carefully insert it into the cut-out around the wheel and push down with a little force until you hear it snap into place.
fr: Le couvre-roue peut être enlevé en pressant sur les deux côtés et simplement en le soulevant sans forcer. Une fois le couvercle de la roue ôté, il devient possible, en maintenant celle-ci, de retirer ou réinstaller la manivelle sur son axe. Pour remettre en place le couvre-roue, l’insérer avec précaution dans les rainures autour de la roue, et l'enfoncer sans forcer jusqu'à entendre un bruit indiquant qu'il est bien enclenché.

source: (5) Wheel Brake Control
fr: (5) Contrôleur du frein de la roue

source: The black knob right next to the wheel cover controls the wheel brake. It is used to adjust the amount of resistance that you feel while turning the crank, simulating strings pressing down onto the wheel. Turn right to pull it tighter and increase the required force, turn left to loosen the brake and reduce the required force. Always turn the crank while adjusting the brake to avoid overloading the wheel and axle! Excessive force on the brake might damage the parts of the braking system.
fr: Le bouton noir juste à côté du couvercle de la roue contrôle le frein de la roue. Frein utilisé pour ajuster à votre convenance la résistance ressentie sur la manivelle quand la roue est mise en mouvement, et simuler la pressions de cordes sur celle-ci. Tourner ce bouton vers la droite pour augmenter l'appui « simulé », vers la gauche pour le contraire. Il faut toujours faire le réglage du frein de roue la manivelle en mouvement, afin d'éviter une surcharge de pression sur la roue et son axe. Trop de contrainte sur le frein pourrait endommager le système de freinage.

source: (6) Front panel connectors
fr: (6) Connecteurs du panneau avant

source: The front panel contains all connectors used to interface the MidiGurdy with external components. We will have a closer look at the individual input and output ports in the next section. Instrument strap pins There are three instrument strap pins: one at the front and two pins at the back.
fr: Le panneau avant concentre tous les connecteurs utilisés pour l'interface de la MidiGurdy avec les composants externes. Détails de ces connecteurs d’entrée et de sortie dans la section suivante. Il y a trois points d’accroche: un à l'avant et deux à l'arrière de la MidiGurdy.

source: Location of the battery compartment
fr: Emplacement du compartiment des piles

source: (7) Battery Compartment
fr: (7) Compartiment des piles

source: The battery compartment can be used to power the MidiGurdy via eight AA/R6/Mignon batteries. Please ensure correct polarity of the batteries when inserting them into the instrument.
fr: Le compartiment à piles peut être utilisé pour alimenter la MidiGurdy au moyen de huit piles AA/R6/Mignon. Veuillez vous assurer de la polarité correcte des piles lorsque vous les insérez dans l'instrument.

source: (8) Battery Compartment Screws
fr: (8) Vis du compartiment des piles

source: The lid of the battery compartment is secured in place with two slotted screws. Use a suitable screwdriver to remove or tighten both screws. Please do not use excessive force then tightening the screws.
fr: Le couvercle du compartiment des piles est fixé en place par deux vis à fente. Utilisez un tournevis approprié pour retirer ou serrer les deux vis. N'utilisez pas de force excessive pour ensuite serrer les vis.

source: Tangent box lid buttons
fr: Boutons sur le couvercle du clavier

source: There are two distinct sections that are used to control the many different functions of the MidiGurdy: the five buttons in the tangent box lid and the main user interface.
fr: Il y a deux parties différentes pour contrôler les fonctions de la MidiGurdy : cinq boutons sur le couvercle du clavier et l'Interface Utilisateur Principal.

source: Buttons in the tangent box lid
fr: Boutons dans le couvercle du clavier

source: The lid of the tangent box contains five buttons, arranged in two groups. Let’s look at the group of three buttons closest to the player first, called the “String Buttons“.
fr: Le couvercle du clavier comporte 5 boutons, disposés en deux groupes. Trois boutons proches (S1-S2-S3) servent à régler les différentes "cordes".

source: The String Buttons (S1 S2 S3)
fr: Les Boutons de cordes (S1 S2 S3)

source: These buttons are used to switch individual strings on and off (lift them on and off the wheel). The order of the buttons follows the string positions on an acoustic hurdy-gurdy:
fr: Ces trois boutons sont utilisés pour commuter individuellement ("on" ou "off") les cordes sur la roue. Ils sont disposés comme sur une vielle acoustique :

source: **S1** drone string (closest to the keyboard)
fr: **S1** bourdons (bouton le plus près des touches du clavier)

source: **S2** melody string (centre)
fr: **S2** chanterelles (bouton du milieu)

source: **S3** trompette string (closest to the player)
fr: **S3** trompettes (bouton le plus près du joueur)

source: Press any of these buttons, turn the crank and notice how the string sound gets switched on or off. An illuminated button means the string is currently switched on.
fr: Appuyez sur n'importe lequel de ces trois boutons, tournez la manivelle et notez les cordes activées : un bouton éclairé veut dire que la corde en référence est activée.

source: The Group Buttons (G2 G3)
fr: Les Boutons de groupe (G2 G3)

source: The two black buttons on the tangent box lid are called the “Group“ buttons. The MidiGurdy has a total of nine strings but only three String Buttons for switching the strings on and off. This is why the Strings are arranged in three groups:
fr: Les deux boutons noirs sur le couvercle sont nommés "boutons de Groupe". La MidiGurdy a un total de neuf "cordes" réunies en trois groupe :

source: Group 1 – Drone 1, Melody 1, Trompette 1 (activated by default)
fr: Groupe 1 - Bourdon 1, Chanterelle 1, Trompette 1 (activé par défaut)

source: Group 2 – Drone 2, Melody 2, Trompette 2 ( activated with **G2**)
fr: Groupe 2 - Bourdon 2, Chanterelle 2, Trompette 2 (activé en appuyant sur **G2**)

source: Group 3 – Drone 3, Melody 3, Trompette 3 (activated with **G3**)
fr: Groupe 3 - Bourdon 3, Chanterelle 3, Trompette 3 (activé en appuyant sur **G3**)

source: If you only press the String Buttons **S1**, **S2** or **S3** you are controlling the strings in **Group 1**, as this group is active by default (i.e. if you don’t press any of the Group Buttons.)
fr: En appuyant sur les boutons **S1**, **S2** ou **S3** vous contrôlez les cordes du **Groupe 1** car ce groupe est activé par défaut (i.e si vous n’appuyez pas sur un bouton de groupe.)

source: If you want to control the strings in **Group 2** instead, you simply hold the **G2** button while pressing any of the String Buttons. Or hold the **G3** button while pressing the String Buttons to control the strings in **Group 3**.
fr: Au lieu de cela, pour contrôler les cordes du **Groupe 2**, il suffit de maintenir enfoncé le Bouton **G2** tout en appuyant sur n'importe quel bouton de corde. Ou alors maintenir le Bouton **G3** enfoncé tout en appuyant sur n'importe quel bouton de corde pour avoir le contrôle des cordes du **Groupe 3**.

source: As soon as you press one of the Group Buttons, the illumination of the String Buttons changes to indicate the on/off state of the drone, melody and trompette string in that group.
fr: En appuyant sur l'un des deux boutons de Groupe, l'éclairage des boutons de cordes indique instantanément quelles cordes (bourdons - chanterelles - trompette) sont actives ("on") ou inactives ("off") dans ce groupe.

source: Pressing the Group Buttons only affects which strings you switch on and off with the String Buttons. They have no other effect on the instrument. You can mix and match strings from all groups while playing, or even play all nine strings simultaneously.
fr: Appuyer sur les boutons de Groupe montre seulement quelles cordes sont actives ("on") ou inactives ("off"). Ces boutons n’ont pas d’autre effet sur l’instrument. On peut mixer et assembler les cordes de n'importe quel groupe tout en jouant, et même jouer les neufs cordes simultanément.

source: User Interface
fr: Interface Utilisateur

source: The main user interface of the MidiGurdy
fr: Principal interface utilisateur de la MidiGurdy

source: The main user interface of the MidiGurdy consists of the display, a rotary knob and five buttons. First a short overview explaining the most important functions of the interface. For a detailed description of the settings and the menu system, please see the section :ref:`menu-system`.
fr: L'Interface Utilisateur Principal de la MidiGurdy consiste en un écran, un bouton rotatif et cinq autres boutons. Voici une petite vue d'ensemble décrivant les fonctions les plus importantes de l'interface. Pour une description détaillée des configurations et du menu système, se reporter à la section :ref:`menu-system`.

source: Display
fr: Écran

source: The display of the MidiGurdy is used to show you the current setup of the instrument and is used to display all settings and menu items. By default it shows the so called “Home Screen“ which informs you about the current tuning and on/off state of all strings, the currently selected preset, how the instrument is powered and the estimated battery charge in case you are running on batteries (see :ref:`menu-system` for more details).
fr: L'écran de la MidiGurdy indique la configuration en cours et est utilisé pour paramétrer les cordes autres éléments du menu. Par défaut l'écran nommé "Écran d'Accueil" vous informe sur l’accord de chaque corde et sur son état d’activité (on / off), sur la présélection active (preset) ainsi que sur le mode d'alimentation en cours, avec notamment une icône indiquant la charge disponible en cas de fonctionnement sur batteries (voir :ref:`menu-system` pour plus de détails).

source: Rotary knob (ROT)
fr: Bouton rotatif (ROT)

source: You can turn this knob left and right and also press it like a button. Turning the knob is used to navigate the menu system or to increase or decrease values. Pressing the knob usually selects a menu item or confirms a changed value.
fr: Ce bouton tourne à droite ou à gauche, il peut être également appuyé. Il sert à naviguer dans le "Menu System" ou à augmenter ou diminuer des "valeurs". Presser sur ce bouton permet de sélectionner un élément de "menu" ou de confirmer un changement de valeur.

source: Back button (BACK)
fr: Bouton de retour (BACK)

source: The back button is right next to the rotary knob. Regardless on where you are in the menu system, pressing this button will always cancel the current selection or operation, bring you back to the previous screen and eventually back to the Home screen.
fr: Ce bouton est juste à côté du bouton rotatif. Quelque soit l'élément du "menu système" sélectionné, une pression sur ce bouton annulera toujours la sélection ou l'opération en cours, avec un retour à l'écran précédent et éventuellement à l’Écran d'Accueil.

source: Display Buttons (D1 D2 D3 D4)
fr: Bouton d’affichage (D1 D2 D3 D4)

source: The four buttons under the display are called the “Display Buttons” and activate different functions depending on the currently active menu. By default, the first three buttons activate the configuration menus for
fr: Les quatre boutons sous l’écran sont nommés "boutons d’affichage" et gèrent des fonctions différentes en regard du menu affiché. Par défaut les trois premiers boutons gèrent la configuration des

source: the drone strings **D1**
fr: Bourdons **D1**

source: the melody strings **D2**
fr: Chanterelles **D2**

source: the trompette string **D3**
fr: Trompettes **D3**

source: as indicated by their labels in the display on the Home Screen.
fr: comme indiqué sur "l’Écran d'Accueil".

source: The rightmost button **D4** is also called the “Power / Settings” button. As the name suggests, this button is used for multiple purposes:
fr: Le bouton **D4** (le plus à droite) est aussi nommé bouton "Energie / Réglages". Comme son nom l'indique, il a plusieurs fonctions :

source: Switching the MidiGurdy on and off:
fr: Bouton de mise sous tension de la MidiGurdy :

source: Hold this button for about 1 second to switch the instrument on
fr: En maintenant l'appui sur celui-ci 1 seconde, il met la MidiGurdy sous tension ("on")

source: Hold this button for about 4 seconds to switch the instrument off again
fr: En maintenant l'appui sur celui-ci quatre secondes, il met la MidiGurdy hors tension ("off")

source: Hold this button for about 8 seconds and release it again to do a forced restart of the instrument. Use this if the MidiGurdy has locked up and doesn't react to any user input any more (which hopefully will never happen!)
fr: En maintenant l'appui sur celui-ci huit secondes et en le relâchant, il permet la reconfiguration de l'instrument ("Reset"). Utiliser cette fonction que si la MidiGurdy est bloquée et ne réagit à aucune commande (en espérant que ça n'arrive jamais!)

source: Opening the Presets and Settings menus with a short press of the button
fr: Accès aux préréglages (Presets) et aux menus de configuration par un appui court sur celui-ci
