Repository: midigurdy/mg-docs
Catalog: locales/*/LC_MESSAGES/Important_notes.po
Languages: fr

source: Important notes
fr: Notifications importantes

source: Handling and maintenance
fr: Manipulation et maintenance

source: Always grab the instrument by the body or the rear tangent box support. Never carry or lift the instrument by the keyboard or individual keys!
fr: Toujours saisir l'instrument par le corps ou la partie arrière du clavier. Ne jamais le transporter ou le soulever à l'aide du clavier ou des touches !

source: Use a soft, dry cloth to clean the instrument, which may be slightly moistened if necessary.
fr: Utiliser un chiffon doux et sec pour le nettoyer, qui peut être légèrement humide au besoin.

source: Never use petrol, thinner, alcohol or similar cleaning agents to avoid damaging or discolouring the surface of the instrument.
fr: Ne jamais utiliser de pétrole, de diluant, d'alcool ou des agents nettoyants similaires pour éviter d'abimer ou de décolorer la surface de l'instrument.

source: All user-adjustable screws and controls should only ever be hand-tightened. Never tighten the screws or tuning knobs with great force.
fr: Toutes les parties réglables par vis et leurs contrôles devront être faites de "main sûre". Ne jamais serrer les vis ou manipuler les boutons en force.

source: Precautions for batteries
fr: Batteries: précautions d’usage

source: The required ambient temperature depends on the batteries used. Refer to the battery documentation. Never use or store the batteries in extremely hot places, e.g. in direct sunlight, in a closed vehicle or near a radiator. This could lead to leakage of battery fluid and shorten the battery life.
fr: La température ambiante requises dépend de l'usure des batteries. Se référer à la documentation les concernant. Ne jamais utiliser ou conserver les batteries dans des endroits très chauds, i.e en plein soleil, dans un véhicule fermé ou près d'un radiateur. Ceci pourrait conduire à l'écoulement du fluide de la batterie et abréger sa durée de vie.

source: Keep the batteries dry and ensure that the connections are never exposed to moisture. This could lead to overheating or rusting on the battery and on the connections.
fr: Garder les batteries au sec en vous assurant que leurs connexions ne soit jamais exposées à la moisissure. Ceci pourrait provoquer leur surchauffe ou leur oxydation, ainsi que celle des connexions.

source: Make sure that batteries are never within the reach of small children.
fr: Tenir les batteries hors de portée des enfants.

source: Never hit the batteries or drop them. Strong shocks can lead to leakage of battery fluid, excessive heat generation, explosion or fire.
fr: Ne jamais cogner ou faire tomber les batteries. un choc important pourrait les faire "couler", générer une chaleur excessive , une explosion ou un feu.

source: Further Precautions
fr: Précautions supplémentaires

source: Handle the controls and connectors of the instrument with due care. Excessive handling can lead to damage.
fr: Manipuler les contrôles et les connecteurs avec soin. Des manipulations inappropriées pourraient occasionner des dégâts.

source: Never press or hit the display or place heavy objects on it.
fr: Ne jamais presser ou heurter l’écran de contrôle, ni mettre des objets lourds dessus.

source: When making or removing the connections, pull only on the plugs - never on the cables. This will prevent any damage to the cables and the instrument.
fr: En branchant ou débranchant les connexions, se servir des prises mais ne jamais tirer sur les câbles, pour éviter de les endommager ou d’endommager l’instrument.

source: The instrument should only be serviced by an expert. Before opening the base plate, the instrument must be disconnected from all power sources (power supply, USB connection, battery).
fr: Seul un expert peut intervenir sur l’instrument. Avant toute intervention il doit être déconnecté de toute source électrique (transformateur, connexion USB, batteries).

source: Only use the original 5V power supply to power the instrument via the power connector. And only connect the 5V power supply to a suitable power outlet. Never plug it into an outlet of another voltage.
fr: Utiliser uniquement l’adaptateur original 5 V (fourni) pour mettre l’instrument sous tension via la prise correspondant. Brancher le transformateur 5V uniquement sur une prise délivrant une tension appropriée et jamais sur une prise d’un voltage différent.

source: Notice regarding disposal (EU only)
fr: Mise au rebut (U.E. uniquement)

source: When this “crossed-out wheeled bin” symbol is displayed on the product, owner’s manual, battery, or battery package, it signifies that when you wish to dispose of this product, manual, package or battery you must do so in an approved manner.
fr: Le symbole d’un container barré apposé sur un produit, un manuel d’utilisateur, une batterie ou emballage de batterie signifie que quand vous souhaitez mettre au rebut ce produit, vous devez le faire conformément aux dispositions en vigueur.

source: Do not discard this product, manual, package or battery along with ordinary household waste. Disposing in the correct manner will prevent harm to human health and potential damage to the environment.
fr: Ne jetez pas ce produit, manuel d’utilisateur, emballage ou batterie dans les poubelles ordinaires. Mettre au rebut de la façon appropriée préviendra de la nocivité pour la santé humaine ainsi que de potentiels dommages pour l’environnement.

source: Since the correct method of disposal will depend on the applicable laws and regulations in your locality, please contact your local administrative body for details. If the battery contains heavy metals in excess of the regulated amount, a chemical symbol is displayed below the “crossed-out wheeled bin” symbol on the battery or battery package.
fr: Puisque la mise au rebut adéquat dépend des lois et règlements en vigueur dans votre pays, merci de contacter votre administration locale pour les détails. Quand la batterie contient des métaux lourds en excès par rapport à la dose autorisée, un symbole chimique sous le symbole du container barré est apposé sur la batterie ou son emballage.
