Repository: midigurdy/mg-docs
Catalog: locales/*/LC_MESSAGES/index.po
Languages: de, es, fr

source: MidiGurdy User Manual
de: MidiGurdy Benutzeranleitung
es: Manual del usuario de MidiGurdy
fr: Manuel d'utilisation de la MidiGurdy

source: For firmware version |version|
de: Für Firmware Version |version|
es: Para la versión de firmware |version|
fr: Pour la version du firmware |version|

source: This is the online user manual for the MidiGurdy - an electronic hurdy-gurdy. For more information about the instrument, please visit http://www.midigurdy.com.
de: Dies ist die Online-Bedienungsanleitung für die MidiGurdy - eine elektronische Drehleier. Weitere Informationen über das Musikinstrument gibt es unter http://www.midigurdy.com.
es: Este es el manual de usuario en línea de la MidiGurdy - una zanfona electrónica. Para obtener más información sobre el instrumento, visite http://www.midigurdy.com.
fr: Ceci est le manuel d'utilisation en ligne de la MidiGurdy - une vielle à roue électronique. Pour plus d'informations sur l'instrument, veuillez consulter le site http://www.midigurdy.com.

source: Other formats
de: Andere Formate
es: Otros formatos
fr: Autres formats

source: If you would like to read this documentation in another format, please see the links below:
de: Um diese Anleitung in anderen Formaten zu lesen, bitte die untenstehenden Links verwenden:
es: Si desea leer esta documentación en otro formato, consulte los siguientes enlaces:
fr: Si vous souhaitez lire cette documentation dans un autre format, veuillez consulter les liens ci-dessous :

source: `Single HTML page <../singlehtml/index.html>`_
de: `Eine HTML Seite <../singlehtml/index.html>`_
es: `Una sola página HTML <../singlehtml/index.html>`_
fr: `Une seule page HTML <.../singlehtml/index.html>`_

source: `Separate HTML pages <../html/index.html>`_
de: `Getrennte HTML Seiten <../html/index.html>`_
es: `Separar páginas HTML <../html/index.html>`_
fr: `Pages HTML séparées <.../html/index.html>`_

source: `Download PDF document <../download/midigurdy_manual.pdf>`_
de: `PDF Dokument herunterladen <../download/midigurdy_manual.pdf>`_
es: `Descargar documento PDF <../download/midigurdy_manual.pdf>`_
fr: `Télécharger le document PDF <.../télécharger/midigurdy_manual.pdf>`

source: `Download eBook (EPUB) <../download/midigurdy_manual.epub>`_
de: `eBook (EPUB) herunterlaten <../download/midigurdy_manual.epub>`_
es: `Descargar eBook (EPUB) <../download/midigurdy_manual.epub>`_
fr: `Télécharger un livre électronique (EPUB) <../télécharger/midigurdy_manual.epub>`_

source: Table of Contents
de: Inhaltsverzeichnis
es: Tabla de Contenidos
fr: Table des matières
