Repository: midigurdy/mg-docs
Catalog: locales/*/LC_MESSAGES/Introducing_the_MidiGurdy.po
Languages: fr

source: Introducing the MidiGurdy
fr: Présentation de la MidiGurdy

source: The MidiGurdy is a fully electronic hurdy-gurdy that is designed to have a playing-feel as close to an acoustic hurdy-gurdy as possible.
fr: La MidiGurdy est une vielle à roue totalement electronique, é conçue pour sonner et donner des sensations de jeu aussi près que possible de celles rencontrées avec une vielle acoustique.

source: Intended use
fr: Utilisation prévue

source: The main purpose of the MidiGurdy is to be tool for rehearsal, learning and teaching hurdy-gurdy playing techniques.
fr: Le principal objectif de la MidiGurdy est d'être un instrument de répétition, d'apprentissage et d'enseignement des techniques de jeu.

source: Hold and play it as you would do with an acoustic hurdy-gurdy. To hear the produced sounds, attach headphones or connect the instrument to an external amplifier or mixing desk. If you have an acoustic hurdy-gurdy, use the the mechanical features and software settings to change the playing feel and sound to match them to your acoustic instrument.
fr: Prenez-la et jouez-en comme vous le feriez avec une vielle acoustique. Pour entendre les sons produits, il suffit de brancher un casque audio, de la connecter à un amplificateur externe ou une table de mixage. Si vous avez une vielle acoustique, vous pouvez utiliser les caractéristiques mécaniques et les dispositions du logiciel pour changer vos sensations de jeu et le son afin de les rendre comparables à celle-là.

source: Attach the instrument to a computer to see a visual representation of your trompette technique. See where you place your coups and check the speed of your crank. Or use the visualisation to teach your trompette technique to others.
fr: Raccordez la MidiGurdy à un ordinateur et vous pourrez visualiser votre technique de "trompette" (coup de poignet). Regardez où sont placés vos "coups" et contrôlez la vitesse de la manivelle. Vous pouvez aussi utiliser cette visualisation pour enseigner votre technique de "trompette" à d'autres.

source: The MidiGurdy is also a new electronic musical instrument in it’s own right. You can use it as a MIDI-controller to control external synthesizers or use the built-in software synthesizer with non-hurdy-gurdy sounds.
fr: La MidiGurdy est aussi un nouvel instrument électronique à part entière. Elle peut être utilisée comme un contrôleur MIDI pour piloter des synthétiseurs externes sans aucune sonorité de vielle.

source: Features
fr: Caractéristiques

source: No maintenance
fr: Pas d'entretien

source: No acoustic sound production means (nearly) maintenance-free playing: no strings to tune, no cotton to replace, no rosin to be applied to the wheel. Simply pick up the instrument, switch it on and start playing right away.
fr: Pas de production de son acoustique signifie, à quelque chose près, pas d'entretien de jeu : pas de corde à accorder, pas de coton à remplacer, pas de colophane à appliquer sur la roue. Il suffit simplement de prendre l'instrument, le brancher et commencer à jouer.

source: Realistic control
fr: Contrôle réaliste

source: The crank reacts with high precision to your right-hand technique. A physically adjustable brake allows you to change the required force to turn the wheel. A non-vibrating string inside the tangent box with adjustable tension and the movable sensor tangents on the keys allow you to change the playing feel of the keyboard. And the keys are pressure sensitive, offering many of the sound-shaping possibilities of acoustic instruments.
fr: La manivelle réagit avec grande précision à votre technique de main droite. Un frein ajustable physiquement permet de régler à votre guise la force requise quand vous tournez la roue. Dans le clavier une corde nonvibrante et à tension réglable, ainsi que les sautereaux à capteurs mobilisables sur les touches permettent de changer la sensation du jeu sur le clavier. Les touches répondent à la pression, ce qui ouvre les possibilités de travail du son, comme sur les instruments acoustiques.

source: Extensible hurdy-gurdy sounds
fr: Extension de la gamme des sonorités de vielle

source: The MidiGurdy comes pre-loaded with a selection of hurdy-gurdy sounds sampled from real instruments. And you can change them or add new sounds to your liking.
fr: La MidiGurdy propose par défaut une sélection de sonorités de vielles échantillonnées ("samplées") à partir d'instruments existants. Vous pouvez les changer ou en ajouter d'autres à votre goût.

source: Nine strings – in any key or tuning
fr: Neuf cordes - dans toutes les clés et tous les accords

source: There are three melody, three drone and three trompette strings you can configure and control individually.
fr: Il y a trois chanterelles, trois bourdons et trois chiens, tous configurables et réglables indépendamment.

source: Practice anywhere - in silence
fr: Pratiquer partout - en "silence"

source: Playing with headphones means you can play even late at night without disturbing anyone. And the smaller form factor compared to most acoustic instruments make it more portable.
fr: Avec un casque audio, il est possible de jouer la MidiGurdy tard dans la nuit en ne dérangeant personne. Sa petite taille comparée à la plupart des instruments acoustiques la rend très facilement transportable.

source: Two interfaces
fr: Deux Interfaces

source: Many of the MidiGurdy features can be controlled via the buttons and display on the instrument itself, but also more comfortably via a Web-Browser when you connect the MidiGurdy to your computer.
fr: Un grand nombre des caractéristiques de la MidiGurdy peut être contrôlé via les boutons et l'affichage sur l'instrument lui-même, mais aussi encore plus facilement via un navigateur -Web quand vous la connectez à votre ordinateur.

source: Open to all
fr: Ouvert à tous

source: The MidiGurdy software and sounds are all released under an Open-Source license and new versions will always be free of charge.
fr: Le logiciel MidiGurdy et les sonorités sont libres de droit (Open Source) et les nouvelles versions seront toujours gratuites.
