Repository: midigurdy/mg-docs
Catalog: locales/*/LC_MESSAGES/MIDI.po
Languages: fr

source: MIDI with the MidiGurdy
fr: MIDI avec la MidiGurdy

source: With the USB MIDI output feature, you are able to use the MidiGurdy as a MIDI controller, for example to control external synthesizers or use the instrument to input notes in a music notation editor.
fr: Avec la sortie MIDI USB, vous pouvez utiliser la MidiGurdy comme contrôleur MIDI, par exemple pour contrôler des synthétiseurs externes ou utiliser l'instrument pour entrer des notes dans un éditeur de notation musicale.

source: Connecting to MIDI devices
fr: Connexion à des périphériques MIDI

source: To use this feature, you first need to connect the MidiGurdy to another device. There are a number of different ways on how you can make this connection.
fr: Pour utiliser cette fonction, vous devez d'abord connecter le MidiGurdy à un autre appareil. Il y a plusieurs façons d'établir ce lien.

source: USB MIDI to Computer or Tablet
fr: USB MIDI vers ordinateur ou tablette

source: If you want to use the MidiGurdy as an input device to write musical notation, if you want it to control a software synthesizer or other musical software running on your computer, you can simply connect your instrument to your computer as if you wanted to access the web-interface. So use a USB-A to USB-B cable, attach the USB-A plug into your computer and the (square) USB-B plug into the MidiGurdy.
fr: Si vous voulez utiliser le MidiGurdy comme périphérique d'entrée pour écrire des notations musicales, si vous voulez qu'il contrôle un synthétiseur logiciel ou un autre logiciel musical fonctionnant sur votre ordinateur, vous pouvez simplement connecter votre instrument à votre ordinateur comme si vous voulez accéder à l'interface web. Utilisez donc un câble USB-A à USB-B, branchez la prise USB-A dans votre ordinateur et la prise USB-B (carrée) dans la MidiGurdy.

source: Depending on your operating system, you might need to open up the Sound or MIDI device preferences.
fr: Selon votre système, vous devrez peut-être ouvrir les préférences du périphérique Sound ou MIDI.

source: Unlike the web-interface, the MIDI function should work on Android as well!
fr: Contrairement à l'interface web, la fonction MIDI devrait également fonctionner sur Android !

source: The MidiGurdy registers as a MIDI device to your computer as soon as you plug it in, but it does not send any MIDI messages until you enable the connection on the instrument as follows:
fr: Le MidiGurdy s'enregistre en tant que périphérique MIDI sur votre ordinateur dès que vous le branchez, mais il n'envoie aucun message MIDI tant que vous n'avez pas activé la connexion sur l'instrument comme suit :

source: Press D4 twice to go to the Configuration menu
fr: Appuyez deux fois sur D4 pour accéder au menu Configuration

source: Turn the rotary knob to scroll down to the "MIDI..." entry
fr: Tournez le bouton rotatif pour faire défiler vers le bas jusqu'à l'entrée "MIDI..."

source: Press the rotary knob to open the list of MIDI devices
fr: Appuyez sur le bouton rotatif pour ouvrir la liste des périphériques MIDI

source: You will see only one entry: "Main Midi...". Select it by pressing the rotary knob
fr: Vous ne verrez qu'une seule entrée : "Main Midi...". Sélectionnez-le en appuyant sur le bouton rotatif

source: Turn the rotary knob to scroll down to "Output" and press the rotary knob to active the option
fr: Tournez le bouton rotatif pour faire défiler vers le bas jusqu'à "Output" et appuyez sur le bouton rotatif pour activer l'option

source: Turn the rotary knob to switch between the options "Off", "On" and "Auto-On"
fr: Tournez le bouton rotatif pour commuter entre les options "Off", "On" et "Auto-On"

source: **Off** means the MidiGurdy does not send any MIDI messages (the default and best option if you don't use this feature, to conserve processing power and battery consumption).
fr: **Off** signifie que le MidiGurdy n'envoie aucun message MIDI (la meilleure option par défaut si vous n'utilisez pas cette fonction, pour économiser la puissance de traitement et la consommation de batterie).

source: **On** means that the MidiGurdy will send MIDI messages via this connection. If you disconnect the USB cable and plug it back in, you will need to manually enable it again to send MIDI messages.
fr: **On** signifie que le MidiGurdy enverra des messages MIDI via cette connexion. Si vous débranchez le câble USB et le rebranchez, vous devrez l'activer manuellement pour envoyer des messages MIDI.

source: **Auto-On** means that the connection is On (MIDI messages are sent) and if you disconnect the USB cable and plug it back in, the connection will automatically be enabled again.
fr: **Auto-On** signifie que la connexion est activée (des messages MIDI sont envoyés) et si vous débranchez le câble USB et le rebranchez, la connexion sera automatiquement réactivée.

source: So as soon as the "Output" value is **On** or **Auto-On**, the MidiGurdy will start sending MIDI messages to your computer.
fr: Ainsi, dès que la valeur "Output" est **On** ou **Auto-On**, le MidiGurdy commence à envoyer des messages MIDI à votre ordinateur.

source: USB MIDI to another USB MIDI device
fr: USB MIDI vers un autre périphérique USB MIDI

source: If you want to use the MidiGurdy to control another MIDI device that has a USB MIDI port (like a more modern synthesizer, a MIDI expander or similar), you can use the same USB-A to USB-B cable that you use for the connection to a computer.
fr: Si vous souhaitez utiliser la MidiGurdy pour contrôler un autre périphérique MIDI doté d'un port MIDI USB (comme un synthétiseur plus moderne, un expandeur MIDI ou similaire), vous pouvez utiliser le même câble USB-A vers USB-B que vous utilisez pour la connexion à un ordinateur.

source: But the way you use the cable is different: attach the square USB-B plug to your external MIDI device and plug in the USB-A plug into the vertical USB-A port on the MidiGurdy.
fr: Mais la façon dont vous utilisez le câble est différente : branchez la fiche USB-B carrée à votre appareil MIDI externe et branchez la fiche USB-A dans le port USB-A vertical de la MidiGurdy.

source: Open the MIDI configuration on the MidiGurdy (press D4 twice, scroll down to "MIDI...") and you should see a new entry in the list. The name of this entry depends on how your external MIDI device registers itself. As with the previous connection method, select the MIDI connection by pressing the rotary knob, scroll down to "Output" and set it to "On" or "Auto-On".
fr: Ouvrez la configuration MIDI sur la MidiGurdy (appuyez deux fois sur D4, faites défiler jusqu'à "MIDI...") et vous devriez voir une nouvelle entrée dans la liste. Le nom de cette entrée dépend de la façon dont votre périphérique MIDI externe s'enregistre lui-même. Comme pour la méthode de connexion précédente, sélectionnez la connexion MIDI en appuyant sur le bouton rotatif, faites défiler jusqu'à "Output" et réglez-la sur "On" ou "Auto-On".

source: Connecting to an old-style (5-pin) MIDI device
fr: Connexion à un périphérique MIDI de type ancien (5 broches)

source: If you want to control a device with the old-style 5-pin MIDI connector, you will need a USB to 5-pin MIDI adapter cable. These adapter cables can be bought in many places, many at very affordable prices (a few Euro). Any cable that requires no additional drivers for Windows will work fine with the MidiGurdy.
fr: Si vous voulez contrôler un appareil avec l'ancien connecteur MIDI à 5 broches, vous aurez besoin d'un câble adaptateur MIDI USB vers 5 broches. Ces câbles adaptateurs peuvent être achetés dans de nombreux endroits, beaucoup à des prix très abordables (quelques euros). Tout câble qui ne nécessite aucun pilote supplémentaire pour Windows fonctionnera parfaitement avec le MidiGurdy.

source: If you have a USB to 5-pin MIDI adapter available, connect its USB-A plug to the vertical USB-A port on the MidiGurdy.
fr: Si vous disposez d'un adaptateur MIDI USB vers 5 broches, branchez sa prise USB-A sur le port USB-A vertical du MidiGurdy.

source: Open the MIDI configuration on the MidiGurdy (press D4 twice, scroll down to "MIDI...") and you should see a new entry in the list. The name of this entry depends on how your adapter cable calls itself. Often it is something like "MIDI cable #1" or similar. As with the previous connection methods, select the MIDI connection by pressing the rotary knob, scroll down to "Output" and set it to **On** or **Auto-On**.
fr: Ouvrez la configuration MIDI sur la MidiGurdy (appuyez deux fois sur D4, faites défiler jusqu'à "MIDI...") et vous devriez voir une nouvelle entrée dans la liste. Le nom de cette entrée dépend de la façon dont votre câble adaptateur s'appelle. Souvent, il s'agit de quelque chose comme "Câble MIDI #1" ou similaire. Comme pour les méthodes de connexion précédentes, sélectionnez la connexion MIDI en appuyant sur le bouton rotatif, faites défiler jusqu'à "Output" et réglez-la sur **On** ou **Auto-On**.

source: MIDI messages sent by the MidiGurdy
fr: Messages MIDI envoyés par la MidiGurdy

source: The MidiGurdy outputs MIDI messages on three separate MIDI channels, one for each string type. By default, the following MIDI channels are used:
fr: La MidiGurdy émet des messages MIDI sur trois canaux MIDI distincts, un pour chaque type de corde. Par défaut, les canaux MIDI suivants sont utilisés :

source: Melody: MIDI channel 1
fr: Chanterelle: Canal MIDI 1

source: Trompette: MIDI channel 2
fr: Trompette : Canal MIDI 2

source: Drone: MIDI channel 3
fr: Bourdon : Canal MIDI 3

source: Which strings output via MIDI
fr: Quelles cordes sortent via MIDI

source: **Important:** only strings that are configured (have a sound assigned to them) and enabled (green LED button is on) actually send MIDI messages. And only the first string of each type actually outputs via MIDI, so only Melody 1, Drone 1 and Trompette 1
fr: **Important:** seules les cordes qui sont configurées (un son leur est assigné) et activées (le bouton LED vert est allumé) envoient réellement des messages MIDI. Et seule la première corde de chaque type sort en MIDI, donc seulement Melody 1, Drone 1 et Trompette 1

source: Melody String MIDI Messages
fr: Messages MIDI des cordes de chanterelle

source: Note On/Off, with a range of fixed velocities - sent in reaction to key presses and wheel start / stop
fr: Note On/Off, avec une gamme de vitesses fixes - envoyées en réaction à des pressions de touches et à la mise en marche/arrêt de la roue

source: Expression Control (CC 11) - used for volume instead of Note-on velocity, controlled by the speed of the wheel
fr: Expression Control (CC 11) - est utilisé pour le volume au lieu de la vitesse de Note-on, contrôlée par la vitesse de la roue

source: Channel pitch bend - depends on the key pressure of the highest pressed key
fr: Channel pitch bend - dépend de la pression de touche de la touche la plus élevée appuyée

source: Keyboard Mode
fr: Mode clavier (Keyboard Mode)

source: **Note:** If you choose **Keyboard mode** for the melody string, no expression messages get sent and the velocity (volume) of the Note On messages is determined by the speed / force with which you press the keys. In this mode the MidiGurdy melody string behaves similar to a keyboard / piano.
fr: **Note:** Si vous choisissez **Mode clavier** pour la chanterelle, aucun message d'expression n'est envoyé et la vitesse (volume) des messages Note On est déterminée par la vitesse / force avec laquelle vous appuyez sur les touches. Dans ce mode, la chanterelle de la MidiGurdy se comporte comme un clavier / piano.

source: Drone String MIDI Messages
fr: Messages MIDI pour cordes de bourdons

source: Note on/off, with fixed velocity
fr: Note on/off, avec vitesse fixe

source: Trompette String MIDI Messages
fr: Messages MIDI des cordes de trompette

source: **In "MidiGurdy" mode:***
fr: **En mode "MidiGurdy":**

source: Note on/off, with fixed velocity - Note On as soon as you move the wheel
fr: Note on/off, à vitesse fixe - Note on dès que vous déplacez la roue

source: Expression (CC 11) - used for volume, controlled by the speed of the wheel
fr: Expression (CC 11) - utilisée pour le volume, contrôlée par la vitesse de la roue

source: Channel Pressure - controlled by the speed of the wheel above the chien sensitivity threshold
fr: Channel Pressure - contrôlée par la vitesse de la roue au-dessus du seuil de sensibilité du chien

source: **In "Percussion" mode:**
fr: **En mode "Percussion" :**

source: Note on/off - Note On only for a coup impulse, velocity is the speed of the initial impulse)
fr: Note on/off - Note on seulement pour une impulsion de coup, la vitesse est la vitesse de l'impulsion initiale)

source: MIDI Output Configuration
fr: Configuration de la sortie MIDI

source: There are a few settings you can change on a MIDI output. These settings will be automatically saved and recalled when you reconnect a MIDI device with the same name as before.
fr: Il y a quelques réglages que vous pouvez modifier sur une sortie MIDI. Ces réglages seront automatiquement sauvegardés et rappelés lorsque vous reconnecterez un périphérique MIDI portant le même nom que précédemment.

source: **Melody channel**: Determines the MIDI channel for the melody string.
fr: **Melody channel** (Canal Mélodie) : Détermine le canal MIDI de la corde mélodique.

source: **Drone channel**: Determines the MIDI channel for the drone string.
fr: **Drone channel** (Canal Bourdon) : Détermine le canal MIDI de la corde du bourdon.

source: **Trompette channel**: Determines the MIDI channel for the drone string.
fr: **Trompette channel** (Canal de la trompette) : Détermine le canal MIDI de la corde du trompette.

source: **Program Change**: Controls if program and bank change messages should be sent to the external MIDI device. If this setting is enabled, every time you change a sound of a string sends a program and bank change message with the bank and program number of the selected sound. The default of this setting is off, so no program change messages are being sent.
fr: **Program Change** (Changement de programme) : Contrôle si les messages de changement de programme et de banque doivent être envoyés au périphérique MIDI externe. Si ce paramètre est activé, chaque fois que vous modifiez le son d'une chaîne de caractères envoie un message de changement de programme et de banque avec le numéro de banque et de programme du son sélectionné. La valeur par défaut de ce paramètre est désactivée, de sorte qu'aucun message de changement de programme n'est envoyé.

source: **Speed**: Use this setting to control the maximum number of MIDI messages per second that the MidiGurdy sends over this connection. The default value of "Standard" limits the total number of messages sent across all channels to below 1000 per second, which is the maximum that most standard MIDI devices can cope with. The downside is that the resolution of the messages gets reduced and the latency of the messages is higher.
fr: **Speed** (Vitesse) : Utilisez ce paramètre pour contrôler le nombre maximum de messages MIDI par seconde que le MidiGurdy envoie sur cette connexion. La valeur par défaut de "Standard" limite le nombre total de messages envoyés sur tous les canaux à moins de 1000 par seconde, ce qui est le maximum que la plupart des appareils MIDI standard peuvent supporter. L'inconvénient est que la résolution des messages est réduite et la latence des messages est plus élevée.

source: If you connect to a MIDI device that has more processing power and can cope with more messages per second, you can try the "Fast" setting. This will limit the maximum number of messages per second to 2000. There will be much less latency and resolution loss.
fr: Si vous vous connectez à un appareil MIDI plus puissant et capable de traiter plus de messages par seconde, vous pouvez essayer le réglage "Fast". Cela limitera le nombre maximum de messages par seconde à 2000. Il y aura beaucoup moins de perte de latence et de résolution.

source: "Unlimited" does not limit the number of messages in any way, so they are sent out via MIDI as they get generated by the internal sensors and modelling. Depending on your playing style, string modes and enabled strings, it can be as much as 5000 messages per second.
fr: "Illimité" ne limite en aucun cas le nombre de messages, ils sont donc envoyés via MIDI au fur et à mesure qu'ils sont générés par les capteurs internes et la modélisation. Selon votre style de jeu, les modes de cordes et les cordes activées, il peut y avoir jusqu'à 5000 messages par seconde.
