Repository: midigurdy/mg-docs
Catalog: locales/*/LC_MESSAGES/Software_Upgrade.po
Languages: fr

source: Software Upgrades
fr: Mises à Jour du Logiciel

source: From time to time it might be necessary to upgrade the Software running on the MidiGurdy to a new version. Either to fix existing problems or to take advantage of new features.
fr: De temps en temps il sera nécessaire d'effectuer des Mises à Jour du Logiciel embarqué sur la MidiGurdy vers une version plus récente. Soit pour réparer des problèmes rencontrés ou alors pour profiter de nouvelles caractéristiques.

source: MidiGurdy Software Download
fr: Téléchargement du Logiciel de la MidiGurdy

source: The newest versions of the MidiGurdy software can always be found in the download section of the MidiGurdy website: http://www.midigurdy.com/downloads/
fr: Les plus récentes versions de la MG seront toujours disponibles dans la section du site de MidiGurdy: http://www.midigurdy.com/downloads/

source: Software Version and Compatibility
fr: Version Logiciel et Compatibilité

source: The versioning of the software follows a simple scheme: <Major Version>.<Minor Version>.<Patch level>. For example, the Version number “1.11.5” is major version 1, minor version 11 and patch level 5.
fr: La façon de désigner la version du logiciel suit un schéma simple: <Version Principale> <Version Secondaire > <Correctifs > [<Major version> <Minor Version> <Patchlevel>] Par exemple pour la version "1.11.5, la version principale est la version "1", la version secondaire la "11" et le niveau des Correctifs est le "5".

source: The patch level is increased for small changes or bugfixes that don’t change the behaviour of the instrument in a noticeable way (apart from fixing the bug, of course).
fr: Le Correctif <Patchlevel> est augmenté lors de petits changements ou de la correction d'erreurs (bugfix) ce qui n'affecte pas de façon notable le comportement général de l'instrument (à part la correction des erreurs, évidemment).

source: The minor version is increased for new features or changed behaviour that are noticeable for the user, but still work with your existing configuration and presets.
fr: La Version Secondaire <Minor Version> est augmentée par de nouvelles caractéristiques ou par un changement influant sur le comportement de l'instrument, remarquable par l'utilisateur. Cependant l'instrument fonctionne encore avec la configuration et les préréglages existants.

source: A new major version indicates that there are changes that are incompatible with the previous version and therefore require you to backup your configuration before the upgrade and restore ( or recreate) it again afterwards.
fr: Une nouvelle Version Principale <Major version> implique des changements incompatibles avec la version précédente. Il sera donc nécessaire de sauvegarder votre configuration avant de faire la MAJ, pour la restaurer (ou la recréer) après.

source: Always read the release notes!
fr: Toujours lire les notes mises à disposition !

source: When upgrading to a new version, please read the release notes carefully before upgrading!
fr: Avant de migrer vers une nouvelle version, merci de lire attentivement les notes d'information la concernant !

source: Upgrading via USB stick
fr: Mise à Jour (MAJ) par clé USB

source: Eject the USB stick from your computer and attach it to the MidiGurdy via the USB-A host port. After a few seconds the MidiGurdy will inform you that it has found an upgrade file on the USB stick and ask if you want to go ahead with the upgrade. Follow the instructions on the display to complete the upgrade process.
fr: Ejectez la clé USB de votre ordinateur et reliez-la au port USB-A de la MidiGurdy. Après quelques secondes la MidiGurdy vous informera qu'un dossier de MAJ a été détecté sur la clé USB, et demandera si vous voulez aller poursuivre cette MAJ. Il suffira de suivre les instructions sur l'écran pour achever cette MAJ.

source: Important: Do not interrupt the upgrade!
fr: Important: ne pas interrompre la mise à jour avant la fin du processus !

source: Do not switch off the MidiGurdy while the upgrade is in progress and ensure that the instrument is supplied with sufficient power before starting the upgrade!
fr: Pendant la MAJ il est impératif de ne pas déconnecter la MidiGurdy. Avant de commencer la MAJ, assurez-vous que l'alimentation en électricité de l'instrument est suffisante !

source: During the upgrade, the String Buttons in the tangent box lid will flash to indicate that the upgrade is in progress. Once the upgrade has finished, remove the USB stick from the MidiGurdy and press any button to restart the instrument. After a successful upgrade, the version number shown during start-up should match the version you wanted to upgrade to.
fr: Pendant la MAJ les Boutons de Cordes situés sur le couvercle du clavier clignoteront indiquant l'avancée d’une MAJ. Une fois celle-ci achevée, ôtez la clé USB de la MidiGurdy et appuyez sur n'importe quel bouton pour redémarrer l’instrument. Après une MAJ réussie, le chiffre de la version visible au démarrage de la MidiGurdy devrait correspondre à celui de la version de la MAJ voulue.

source: Troubleshooting
fr: Dépannages

source: If the MidiGurdy does not start the upgrade process a few seconds after you have inserted the USB stick, please double-check if the upgrade file has actually been written to the USB stick and that the file is called “midigurdy-X.Y.Z.swu”, where X, Y and Z indicate the version you are upgrading to.
fr: Si la MidiGurdy ne lance pas le démarrage de la MAJ quelques secondes après l'insertion de la clé USB , revérifiez que le dossier de Mise à Jour est bien présent sur la clé et qu'il se nomme "midigurdy-X.Y.Z.swu", X, Y et Z indiquant la version de la Mise à Jour.

source: If your USB stick does not work
fr: Si votre clé USB ne fonctionne pas

source: There are some USB sticks that draw a lot of power from the USB port in order to function properly (especially sticks with very high capacity or USB 3.0 transfer speeds). If your stick is not recognized, please try a different USB stick with a lower power consumption.
fr: Pour fonctionner correctement certaines clés USB consomment beaucoup d'énergie à partir du port sur lequel elles sont branchées ( notamment les clés de grande capacités et celles de type USB 3.0 ). Si votre clé USB n'est pas "reconnue", essayez en d'autres consommant mois d'énergie.

source: In case the upgrade process was interrupted by a power failure or has failed due to a different reason, the previous software version will still be intact and working. Simply restarting the MidiGurdy should bring it back into a working state.
fr: Si le processus de MAJ est interrompu par manque d'énergie électrique ou pour toute autre raison, la version logicielle précédente restera opérationnelle. Par simple redémarrage la MidiGurdy devrait être en état de fonctionner.

source: In case the instrument does not start again after all, please contact us for support. As the MidiGurdy uses a replaceable SD-Card for data storage, you will always be able to revive your instrument if an upgrade went horribly wrong.
fr: Au cas ou l'instrument ne redémarre par après tout cela, merci de nous contacter pour de l'aide. Comme la MidiGurdy utilise une carte amovible SD-Card pour le stockage des données, vous pourrez toujours relancer votre instrument au cas de MAJ vraiment mauvaise.

source: Additional Notes
fr: Notes Supplémentaires

source: You can always upgrade or downgrade to any version of the MidiGurdy software. But please take special care when upgrading or downgrading between different major versions!
fr: Vous pouvez toujours revaloriser (upgrade) ou rétrograder (downgrade) le logiciel de la MidiGurdy vers n'importe quelle version logicielle de celle-ci. Mais dans les deux cas, merci de prêter une attention particulière entre les différentes versions principales !
