Repository: midigurdy/mg-docs
Catalog: locales/*/LC_MESSAGES/Technical_Details.po
Languages: fr

source: Technical Details
fr: Détails Techniques

source: Weight
fr: Poids de l'appareil

source: 2.7 kg (without batteries)
fr: 2,7 kg (sans piles)

source: Physical dimensions
fr: Dimensions

source: 53 cm x 20 cm x 12,5 cm (Length x Width x Height, maximum values)
fr: 53 cm x 20 cm x 12,5 cm (Longueur x Largeur x Hauteur, valeurs maximales)

source: Crank thread
fr: Fil de manivelle

source: Processor
fr: Processeur

source: Operating System
fr: Système d'exploitation

source: Electrical Details
fr: Détails électriques

source: Typical power consumption
fr: Consommation électrique typique

source: Supply voltage
fr: Tension d'alimentation

source: 5V DC with supplied power supply
fr: 5V DC avec alimentation fournie

source: Battery supply
fr: Alimentation par piles

source: 8x AA/R6/Mignon batteries
fr: 8x piles AA/R6/Mignon

source: Audio Output
fr: Sortie audio

source: Stereo headphone amplifier
fr: Amplificateur de casque stéréo

source: Connectors
fr: Connecteurs

source: 5V power supply plug
fr: Fiche d'alimentation 5V

source: 2.1 x 5.5 x 9.5mm (center positive)
fr: 2,1 x 5,5 x 9,5 mm (positif central)

source: Headphone jack
fr: Prise casque
