Repository: midigurdy/mg-docs
Catalog: locales/*/LC_MESSAGES/The_Menu_System.po
Languages: fr

source: The Menu System
fr: Le Menu Système

source: This section describes all menus and configuration items that are available on the MidiGurdy.
fr: Cette section détaille tous les menus et les élément de configuration disponibles sur la MidiGurdy.

source: Please note that there are extended features and advanced settings that are only available via the Web Interface. Please see the :ref:`web-interface` on how to access and use it.
fr: Nota-Bene : il y a des caractéristiques supplémentaires et des configurations avancées accessibles uniquement par l'Interface Web. Merci de consulter la section :ref:`web-interface` pour savoir comment y accéder et l'utiliser.

source: Home screen
fr: Écran d'accueil

source: The home screen of the instrument menu
fr: Ecran d’accueil "menu Instrument"

source: The home screen shows the most important information about the current setup of the instrument. The MidiGurdy will always return to the home screen after a configurable period of inactivity (see :ref:`configuration-menu`).
fr: L'Écran d'Accueil représente l'information la plus importante concernant la configuration active de l'instrument. La MidiGurdy "reviendra" toujours sur cet écran après une certaine période d'inactivité de configuration (voir ref:`configuration-menu`).

source: The largest part of the display is taken up by the visualisation of the **current string state and tuning**. From left to right you see the state for the drone, melody and trompette strings. Each area is divided into three sections: the top row shows the first string of each type, the bottom left the second and bottom right the third string. Enabled strings are shown with black text on white background, disabled strings are shown with white text on black background. Each section contains the currently chosen note for that particular string.
fr: La plus grande partie de l'affichage concerne la visualisation de **l'état d'activité et de l’accord des cordes**. De gauche à droite il y a les renseignements concernant le statut des Bourdons, des Chanterelles et des Trompettes. Chaque secteur est divisé en trois partie: Le cadre du haut symbolise la première corde de chaque genre (Bourdon, Chanterelle, Trompette), la seconde et la troisième corde étant respectivement représentées par le cadre en dessous, à gauche pour la seconde corde, et à droite pour la troisième. Les cordes jouables sont symbolisées par une lettre en noir sur un fond blanc, celles n'étant pas utilisées étant en "vidéo inversée (lettre en blanc sur fond noir). Dans chaque cadre il y a l'indication de la note de base choisie pour une corde donnée.

source: As an example, the picture above shows that there are currently four active strings: the first and second drone string, the first melody string and the second trompette string. Drone strings are tuned to D, D and G, the melody strings are all tuned to G and trompette strings are tuned to D, G, and G. P lease note that the display does not show the octave of the current tuning. To see which octave a string is tuned to, you would have to open the respective String Setup Menu (see below) by pressing the buttons under the string label.
fr: Par exemple, l'image ci-dessus montre qu'il y a quatre cordes actives: le premier et le second bourdons (Drone) la première chanterelle (Melody) et la deuxième trompette (Tromp). Les bourdons sont accordés en Ré (D), Ré (D) et Sol (G). Les chanterelles sont accordées en Sol (G). Les trompette sont accordées en Ré (D) Sol (G) et Sol (G). Il faut noter que l'affichage sur l'écran ne montre pas à quel octave se situe l'accord. Pour être renseigné à ce propos il est nécessaire d'ouvrir pour chaque type de corde le "Menu de Configuration des cordes" (voir ci dessous) en appuyant sur les boutons sous le nom des cordes.

source: In the top right corner of the home screen you can see the estimated charge of the batteries as a small battery icon, as well as the currently active power source:
fr: Dans le coin supérieur droit la petite icone de batterie indique l'estimation de l'état électrique disponible :

source: BAT – powered via batteries
fr: BAT - alimentation par piles, avec bilan de charge

source: EXT – powered via 5V power supply
fr: EXT - alimentation par l'adaptateur 5V

source: USB – powered via USB connection
fr: USB - alimentation au moyen du port USB

source: The bottom right corner shows the number of the last loaded preset. See below for an explanation of the preset system.
fr: Sous cette icone se trouve l'indication de la dernière présélection choisie. Ci-après l'explication du système de présélection.

source: **Available controls on the home screen:**
fr: **Contrôles disponibles à partir de l'Ecran d'accueil:**

source: Turn the rotary knob **ROT** left or right to open the Chien Sensitivity menu
fr: Tourner le bouton rotatif **ROT** à droite ou à gauche pour accéder au réglage de la sensibilité du Chien (Trompette)

source: Press the rotary knob **ROT** to cycle through the volume menus for Main Volume, Reverb Volume and Key Volume.
fr: Appuyer sur le bouton rotatif **ROT** pour naviguer dans les menus de volume: Volume principal, Volume de Réverbération et Volume des Touches.

source: Chien Sensitivity
fr: Sensibilité du Chien

source: Probably one of the most important settings you will want to change on the MidiGurdy is the sensitivity of the chien. On an acoustic hurdy-gurdy, you would tighten or loosen the *tirant* for that. On the MidiGurdy, you simply turn **ROT** left or right when you are on the Home Screen.
fr: Certainement un des réglages les plus important que vous voudrez effectuer sur la MidiGurdy: la sensibilité du Chien. Sur une vielle acoustique il suffit de tendre ou détendre le tirant pour obtenir le grésillement désiré. Sur la MidiGurdy, à partir de l'écran d'accueil, il suffit de tourner **ROT** à droite ou à gauche pour affiner ce réglage.

source: Turn right to make the chien more sensitive (to start buzzing at lower cranking speeds), turn left to make it less sensitive.
fr: En tournant le bouton rotatif à droite le Chien devient plus sensible (plus "gras") et inversement en le tournant vers la gauche.

source: Single or separate chien sensitivity
fr: Sensibilité d'un seul chien ou d'un chien à part

source: Please note that by default the chien sensitivity affects all three trompette strings at the same time. If you wish to control the three chien sensitivities separately, please enable this feature in the web-interface by going to "Advanced / Settings" and enabling the option "Separate chien sensitivities" in the "Features" box.
fr: Il faut noter que la sensibilité choisie affecte les trois trompettes de la même façon. Si vous souhaitez contrôler les trois sensibilités du chien séparément, veuillez activer cette fonction dans l'interface web en allant dans "Advanced / Settings" (Avancé / Paramètres) et en activant l'option "Separate chien sensitivitie" (Séparer les sensibilités du chien) dans la case "Features" (Caractéristiques).

source: Volume Menus
fr: Menus des Volumes

source: When you press the rotary knob ROT on the home screen, you reach the Main Volume menu. Turn ROT left and right to decrease or increase the main volume of the instrument.
fr: En appuyant sur le bouton rotatif ROT à partir de l'écran d'accueil, on accède au Menu Principal des Volume. Tourner ROT à droite ou à gauche pour augmenter ou diminuer le Volume Principal de l'instrument.

source: Press **ROT** again to reach the Reverb Volume menu, turn it left and right to decrease or increase the sympathetic string reverberation volume. d
fr: En appuyant à nouveau sur **ROT** on accède au Menu du Volume de la Réverbération. En tournant à droite ou à gauche on augmente ou on diminue le Volume de Réverbération des cordes sympathiques.

source: Press **ROT** again to reach the Key Volume menu, turn it left or right to decrease or increase the volume of the simulated mechanical key noise.
fr: En appuyant à nouveau sur **ROT** on accède au Menu du Volume des touches. En tournant à droite ou à gauche on augmente ou on diminue le Volume simulé du bruit produit par les touches.

source: The **BACK** button will bring you back to the Home Screen.
fr: Presser le bouton **BACK** renvoie à l'Écran d'Accueil.

source: String Menus
fr: Menus des Cordes

source: The String Menus are used to change the setup of all melody, drone and trompette strings of the MidiGurdy. You can access the String Menus by pressing one of the first three buttons D1 D2 D3 under the display, labelled “Drone”, “Melody” and “Tromp” (for Trompette).
fr: Les Menus des Cordes sont utilisés pour changer la configuration de toutes les cordes, chanterelles, bourdons, et chiens de la MidiGurdy. Pour y accéder il faut appuyer sur l’un des trois premiers boutons D1 D2 D3 situés sous l'écran, chacun correspondant respectivement aux bourdons (Drone) aux chanterelles (Melody) et aux trompettes (Tromp).

source: These buttons always open up the String Menu, even when those labels are not shown above the buttons. Only if you see other labels above the buttons will their function be different.
fr: Ces boutons ouvrent toujours le Menu des Cordes, même quand ces noms ne sont pas visibles au dessus des boutons. Leurs fonctions seront différentes uniquement si sont inscrits d'autres noms aux dessus de ces derniers.

source: When you press a String Menu button once, you open the String Menu for the first string of the chosen type, as indicated by the bar on the left of the screen. Press it again to choose the second string, and again to choose the third string.
fr: En appuyant une fois sur un bouton de Menu de Corde, on accède aux réglages pour la première corde du type choisi (bourdons chanterelles ou chiens) comme indiqué sur la barre-icone à gauche de l'écran. Il suffit d'appuyer à nouveau sur le même bouton pour accéder la seconde corde, et une fois de plus pour les réglages concernant la troisième corde.

source: For example, if you press **D2** once, “M1” is selected in the left bar, indicating that you are editing the first melody string. Press it again to to edit the second melody string (“M2” is selected in the left bar) and again to select to edit the third melody string (“M3” selected in the left bar). The drone and trompette buttons work in exactly the same way.
fr: Par exemple en appuyant sur **D2** une fois, "M1" est sélectionné dans la barre de gauche, signifiant qu'on est sur l'édition de la première chanterelle. En appuyant une seconde fois sur la même touche, on pourra éditer la seconde chanterelle, ("M2" sera sélectionnée dans la barre de gauche), et en appuyant encore une fois sur **D2** c'est la troisième chanterelle qui sera éditée ("M3" sélectionné dans la barre à gauche). C’est la même procédure pour les bourdons et les trompettes.

source: Common Menu Items
fr: Éléments Communs au Menus de Cordes

source: All three string types – melody, drone and trompette – start with the same configuration items
fr: Les trois types de cordes (bourdons chanterelles ou chiens) sont configurées de la même façon au démarrage

source: **Sound** – The first item in each String Menu shows the currently selected sound for the string, or “No sound...” if no sound has been selected. Press the rotary knob on this item to choose a sound from the list of installed Soundfonts.
fr: **Sound** (Son) – le premier item dans chaque "Menu Corde" montre le son sélectionné, ou " No Sound..." pas de son s'il n'y en a pas de sélectionné. Appuyer sur le bouton rotatif pour choisir pour cet élément une sonorité dans la Banque de Sons installée (Soundfonts).

source: **Note** – Select this entry to choose the tuning of the string. The chosen note will either be the single continuous note you hear when turning the crank (for drone and trompette), or the fundamental note that you hear on the melody strings if you don’t press a key on the keyboard (the “open string” note).
fr: **Note** – sélectionner cette entrée pour choisir l’accord de la corde. La note choisie sera la seule note audible en tournant la manivelle (pour le bourdon ou la trompette) ou la note fondamentale des chanterelles si aucune touche n'est actionnée sur le clavier (note "à vide").

source: **Volume** – The volume of this string in percentage of the main volume. Use this setting to adjust the volume balance of the strings, for example to reduce the volume of drone and trompette to make the melody stand out more.
fr: **Volume** – Le volume de la corde est un pourcentage du volume principal (Main Volume). Utilisez ce réglage pour ajuster la "balance" des trois catégories de cordes entre elles, par exemple pour réduire le volume du bourdons et de la trompette pour faire ressortir le son des chanterelles.

source: **Balance** – This setting controls where you hear this string in the stereo panorama (left / right).
fr: **Balance** – ce réglage contrôle le son quand il est restitué en stéréophonie (gauche-droite).

source: **Fine Tune** – With this setting you change the fine tuning of the individual string in cent. 100 cent equal one semitone.
fr: **Fine Tune** (Accord Fin) – par ce réglage on ajuste l’accordage fin de chaque corde par centième. 100 centièmes équivaut à un demi-ton.

source: Melody String Items
fr: Menu des Chanterelles (Melody String items)

source: In addition to the items common to all string types, the Melody String Menu contains a few additional items that are only relevant for melody strings:
fr: En plus des éléments communs aux trois types de cordes, le Menu des Chanterelles comporte quelques éléments (items) supplémentaires ne concernant que les chanterelles :

source: **Capo** – Some acoustic hurdy-gurdies allow the player to lock one of the lower keys in a pressed state, effectively acting as a capo for all melody strings. This setting allows you to simulate that setup on the MidiGurdy, separately for each melody string.
fr: **Capo** – Certaines vielles acoustiques permettent au musicien de verrouiller l'une des touches (keys) basses du clavier, agissant ainsi comme un véritable capodastre sur toutes les chanterelles. Cette option vous permet de simuler ce capodastre, de façon indépendante sur chacune des trois.

source: **Polyphonic** – Contrary to most acoustic hurdy-gurdies, you can choose to play the melody strings polyphonically. This means that when you press two or more keys at the same time, you will hear all notes simultaneously instead of just the note of the highest key.
fr: **Polyphonic** – Contrairement à la plupart des vielles acoustiques, il est possible de jouer sur les cordes mélodiques de façon polyphonique.. Cela signifie qu'en appuyant simultanément sur au moins deux touches (ou plus), vous entendrez en même temps toutes les notes jouées, et non pas seulement la plus haute comme sur un instrument acoustique.

source: **Mode** – This setting controls how the physical controls (keyboard and crank) affect the sound generation on this string:
fr: **Mode** – ce réglage contrôle l'influence du jeu physique (clavier et manivelle) dans la génération du son pour cette corde :

source: “Hurdy-Gurdy”: this mode simulates a hurdy-gurdy. The string will only produce a sound if the crank is turned and the keyboard reacts similar to an acoustic hurdy-gurdy. This mode is the default for all “generic” Soundfonts (i.e. Soundfonts which were not specifically created for the MidiGurdy).
fr: "Hurdy-Gurdy" (Vielle à Roue): ce mode simule une vielle à roue acoustique. Les cordes émettront un son seulement quand la manivelle sera actionnée et le clavier réagira comme celui d'une vielle "classique". Ce mode est le mode par défaut pour les Banques de Sons (Soundfonts) "génériques" (i.e les sonorités qui n'ont pas été créées spécifiquement pour la MidiGurdy).

source: “MidiGurdy”: this mode is very similar to the “Hurdy-Gurdy” mode, but adds extended sound control via the keyboard. This mode is mostly useful for Soundfonts which have been specifically created for the MidiGurdy and is the default for those Soundfonts.
fr: "MidiGurdy": ce mode est très proche du mode "Vielle à Roue", mais ajoute un contrôle élargi du son au moyen du clavier. Ce mode est principalement utilisé avec la Banque de Sons spécialement créée pour la MidiGurdy. C'est le mode par défaut pour cette Banque de Sons (Soundfonts).

source: “Keyboard”: in this mode, the string can be played as if the MidiGurdy were a piano. Sound is only controlled via the keyboard and you don’t need to turn the crank to hear a sound. The keyboard is velocity-sensitive, which means that the volume of the sound is dependent on how fast you press the keys.
fr: "Keyboard" (Clavier): par ce mode la MidiGurdy peut être jouée comme s'il s'agissait d'un piano. Les sons sont uniquement contrôlés par les touches du clavier, sans avoir besoin de tourner la manivelle. Le clavier est "sensible à la vitesse", c’est à dire que le volume sonore émis dépend de la vitesse à laquelle vous appuyez sur les touches.

source: Trompette String Items
fr: Menu des Trompettes

source: In addition to the items common to all string types, the Trompette String Menu contains a few additional items that are only relevant for trompette strings:
fr: En plus des éléments communs à tous les types de cordes, le menu des Trompettes contient quelques éléments supplémentaires qui ne concernent que les cordes de trompette :

source: **Mode** – This setting controls how the wheel speed affects the sound generation of this string, especially how the chien sound is generated and controlled:
fr: **Mode** – Ce paramètre contrôle la façon dont la vitesse de rotation de la roue affecte la génération du son de cette corde, en particulier la façon dont le son du chien est généré et contrôlé :

source: “MidiGurdy”: (default) This mode is the default and the correct mode for all hurdy-gurdy trompette / chien sounds designed for the MidiGurdy.
fr: "MidiGurdy" : (par défaut) Ce mode est le mode par défaut et le mode correct pour tous les sons de trompette et de chien conçus pour la MidiGurdy.

source: “Percussion”: this mode is useful if you want to use the chien of the trompette string to trigger other, non-hurdy-gurdy sounds like drums, percussion, plugged base or similar instruments. The string will only output sound if the chien would sound, the volume of the sound depends on how hard and fast the attach of your coup is.
fr: "Percussion" : ce mode est utile si vous voulez utiliser le chien de la trompette pour déclencher d'autres sons qui ne sont pas de la vielle à roue, tels que batterie, percussion, base bouchée ou instruments similaires. La corde n'émettra un son que si le chien sonne, le volume du son dépend de l'intensité et de la rapidité de l'attaque de votre coup.

source: Preset Menu
fr: Menu des Préréglages (Preset Menu)

source: Presets allow you to save and load the setup of the instrument very quickly. The MidiGurdy comes with a few pre-configured presets, but you can create your own presets or edit existing presets to your liking. To open the Preset Menu, press D4 and the list of presets will appear.
fr: Les préréglages permettent de sauvegarder et de "charger" rapidement la configuration de l'instrument. La MidiGurdy est livrée avec quelques configurations préréglées, mais vous pourrez créer vous propres préréglages ou éditer des préréglages existants, à votre guise ! Pour ouvrir le Menu des Préréglages (Preset Menu) appuyer sur D4 et la liste des préréglage apparaît sur l'écran.

source: Loading a preset
fr: Charger un Préréglage

source: To load a preset, select any numbered preset from the list with the rotary knob, then do a short press on the rotary knob.
fr: Pour charger un préréglage, en tournant le bouton rotatif sélectionner dans la liste un préréglage numéroté, puis exercer une courte pression sur le bouton rotatif.

source: Saving a preset
fr: Sauvegarder un Préréglage

source: To save the current instrument setup to a new preset, go to the last entry in the preset list called “New preset...” and press the rotary knob.
fr: Pour sauvegarder la configuration du moment en un nouveau préréglage, il suffit d'aller dans la liste des "presets" ( D4) , de sélectionner la dernière entrée appelée "New Preset..." et d'appuyer sur le bouton rotatif.

source: A new screen will appear in which you can enter a name for the new preset. The first character of the name is highlighted and can be edited by turning ROT left or right to move though the available characters. Pressing the rotary knob after choosing a character moves to the next character position.
fr: Un nouvel écran apparait sur lequel vous pourrez écrire un nom de ce nouveau préréglage. La première lettre du nom est en "surbrillance", vous pourrez la changer en tournant le bouton rotatif à droite ou à gauche. Par une pression sur le bouton rotatif la lettre voulue sera conservée et le curseur positionné sur la lettre suivante.

source: At the bottom of the screen you see new labels for the four buttons under the display:
fr: Au bas de l'écran on peut voir de nouvelles icones au dessus de chaque bouton :

source: Press the buttons under the arrows **<** and **>** to change which character you are currently editing (moving the cursor).
fr: Presser le bouton sous les flèches **<** ou **>** pour changer la lettre qui est en train d'être éditée (en bougeant le curseur).

source: Press the button under DEL to delete the currently selected character and shift all following characters to the left by one place.
fr: Presser le bouton sous DEL pour supprimer la lettre qui est en train d'être éditée et décaler tout ce qui se trouve à sa gauche en une seule fois.

source: Press the button under SAVE to accept the current name and save the preset.
fr: Presser sur le bouton sous SAVE pour accepter le nom actuel et sauvegarder le préréglage.

source: You don’t have to enter a name to save a preset. In that case, the preset is called “Unnamed” in the list of presets and can only be identified by it’s number.
fr: Il n'est pas obligatoire de donner un nom à un préréglage (Preset). Dans ce cas le préréglage sera nommé "Unnamed" dans la liste des préréglages et sera seulement identifié par son numéro.

source: Editing a preset
fr: Éditer un Préréglage

source: To edit an existing preset, select the preset you want to move with the rotary knob and then do a **long press** on ROT to open the Edit Preset Menu. The chosen preset name will be displayed, along with four options: “Move”, “Rename”, “ Replace” and “Delete”. Select one of the options with the rotary knob or press BACK to cancel the operation.
fr: Pour éditer un préréglage existant, sélectionner le préréglage que vous désirez changer à l'aide du bouton rotatif et **appuyez longuement** sur le centre de ce bouton ROT pour ouvrir le Menu d'édition des préréglages. Le nom du préréglage choisi apparaîtra, avec quatre options: "Move" (Déplacer), "REname" (Renommer), "Replace" (Remplacer), "Delete" (Supprimer). Sélectionnez une des options avec le bouton rotatif ROT ou appuyez sur le bouton BACK pour annuler l'opération.

source: Moving a preset
fr: Déplacer un Préréglage

source: When you choose “Move” in the Preset Edit Menu, the preset list will appear with the chosen preset highlighted. Use the rotary knob to move it to the desired position, then do a short press on the rotary knob to save the new position. Or press the BACK button to cancel the operation.
fr: En choisissant "Move" dans le Menu d'Édition des Préréglages, la liste des préréglages apparaît avec le nom du préréglage en "surbrillance". Utiliser le bouton rotatif pour le déplacer dans la position désirée, puis appuyer rapidement sur le bouton rotatif pour la sauvegarder dans sa nouvelle position. Ou appuyer sur le bouton BACK pour annuler l'opération.

source: Renaming a preset
fr: Renommer un Préréglage
