Repository: midigurdy/mg-docs
Catalog: locales/*/LC_MESSAGES/The_Web_Interface.po
Languages: fr

source: The Web Interface
fr: L’interface Web

source: When you connect the MidiGurdy to a desktop computer, laptop or tablet via the USB connection, you will be able to access the Web Interface to configure the instrument, upload new sounds and to use the visualisation of your trompette technique.
fr: En connectant la MidiGurdy à un ordinateur de bureau, un ordinateur portable ou une tablette au moyen de la connexion USB, vous pourrez accéder à l'Interface Web grâce auquel il sera possible de configurer l'instrument, de télécharger de nouvelles sonorités et d’utiliser le système permettant la visualisation de votre technique de trompette ("coup de poignet").

source: In the following description we always call the computing device you are using to access the MidiGurdy “computer”.
fr: Dans les explications suivantes nous appellerons toujours le système informatique utilisé pour avoir accès à la MidiGurdy: "l'ordinateur".

source: Making the connection
fr: Établir une connexion

source: As explained in :ref:`usb-connection`, please use a USB-A to USB-B cable to connect the MidiGurdy to your computer.
fr: Comme expliqué dans la section :ref:`usb-connection` de données vers un ordinateur ou une tablette par prise USB un câble USB-A / USB-B est nécessaire pour connecter la MidiGurdy à votre ordinateur.

source: Once the connection has been established, the MidiGurdy will present itself as a USB network card to your computer. It acts as a a *class-compliant USB* device, which means that you should not have to install special drivers to use it.
fr: Une fois la connexion établie, la MidiGurdy se présentera comme une carte-réseau USB à votre ordinateur. Elle agit comme un dispositif "esclave" (class-compliant USB) ce qui veut dire qu'il n’est pas besoin d’installer un pilote (driver) supplémentaire cette utilisation.

source: The connection has been tested to work on Windows 7, Windows 8, Windows 10, OS X, Linux and iOS.
fr: La connexion a été testée pour fonctionner sous Windows 7, Windows 8, Windows 10, OS X, Linux et iOS.

source: Android Support
fr: Support Android

source: Sadly, the network connection is currently only supported on rooted Android devices. If you don't know what a *rooted Android device* is, then you probably don't have one.
fr: Malheureusement, la connexion réseau n’est actuellement possible qu’avec des appareils "rooted Androïd". Si vous ne savez pas ce qu’est du matériel "rooted Androïd" c’est que probablement vous n’en avez pas.

source: The MidiGurdy and your computer will automatically set up a private network, so only your computer and the MidiGurdy can talk to each other. At no point will the MidiGurdy be accessible to the Internet or someone on the Internet be able to reach the MidiGurdy. Even computers on your local Wi-Fi network will not be able to access the MidiGurdy.
fr: La MidiGurdy et votre ordinateur établissent automatiquement un réseau privé, de fait seulement votre ordinateur et la MidiGurdy pourront "dialoguer" ensemble. La MidiGurdy ne pourra nullement accéder à Internet, comme personne ne pourra accéder à la MidiGurdy depuis Internet. De même les ordinateurs sur votre réseau local Wifi ne pourront pas accéder à la MidiGurdy.

source: By default, the IP address of the MidiGurdy is **10.10.10.10**. So once the connection has been established, open the Web Browser of your choice and type the following into the address bar:
fr: Par défaut l'adresse IP de la MidiGurdy est **10.10.10.10**. Une fois la connexion établie, ouvrez le Navigateur Web (Web Browser) de votre choix et tapez ce qui suit dans votre barre d'adresse :

source: Alternatively, if your computer supports *ZeroConf* (Linux, Android) or *Bonjour* (OS X, Windows), you should be able to access the MidiGurdy via the following URL:
fr: Autrement, si votre ordinateur supporte ZeroConf (Linux, Androïd) ou Bonjour (OS X, Windows), il sera possible d'avoir un accès par l'URL suivante :

source: Windows does not support ZeroConf or Bonjour by default, but you can can install the “Bonjour Print Services for Windows” from the Apple Website to enable support for Bonjour.
fr: Par défaut Windows ne supporte pas ZeroConf ou Bonjour, mais vous pouvez installer les "Bonjour Print Services for Windows" depuis le site Web Apple vers un support disponible pour Bonjour.

source: If you see a web page saying “Welcome to the MidiGurdy!” in your browser, the connection has been established successfully and you are all ready to go.
fr: Si vous voyez une page Web disant "Welcome to the MidiGurdy" dans votre navigateur, cela signifie que la connexion a été établie avec succès et que vous êtes prêt pour naviguer.

source: Features of the Web Interface
fr: Caractéristiques de l'Interface Web

source: The Web Interface gives you access to all settings that are also available via the Menu System on the instrument itself. In addition, there are some functions that are only available via the Web-Interface, namely:
fr: L'interface Web donne accès à toutes les configurations, qui sont aussi disponibles au moyen du Menu Système se trouvant dans l'instrument. En plus, il y a des fonctions uniquement disponibles par l'Interface Web, soit :

source: Adding and removing sounds
fr: L'ajout et la suppression de sonorités

source: Visualisation of the trompette technique
fr: La visualisation de la technique du coup de poignet

source: Advanced configuration to change the response to keyboard and crank
fr: la configuration avancée pour changer la réponse du clavier et de la manivelle

source: Keyboard calibration
fr: le calibrage du clavier

source: The features of the web-interface have not been documented properly yet. Please watch this space for updated documentation.
fr: Les caractéristiques de l’Interface n’ont pas encore été correctement documentées. Merci de regarder cet espace pour la documentation mise à jour.
