Repository: midigurdy/mg-docs
Catalog: locales/*/LC_MESSAGES/The_Menu_System.po
Languages: fr

source: When you choose “Rename” in the Preset Edit Menu, you will be presented with a screen where you can modify the preset name. This screen works just in the same way as if you would save a new preset (see “ Saving a preset” above).
fr: En choisissant "Rename" dans le Menu d'Édition des Préréglages, un écran apparait par lequel il est possible de modifier le nom du préréglage. Cet écran fonctionne de la même façons que pour sauvegarder un nouveau préréglage (voir "Sauvegarde un Préréglage " ci-dessus).

source: Replacing a preset
fr: Remplacer un Préréglage

source: When you choose “Replace” in the Preset Edit Menu, the current instrument setup will be stored over the preset you are currently editing, replacing everything with the new setup.
fr: En choisissant "Replace" dans le Menu d'Édition des Préréglages, la configuration active de l'instrument sera conserver à la place du préréglage en édition, remplaçant tout par une nouvelle configuration.

source: Deleting a preset
fr: Supprimer un Préréglage

source: When you choose “Delete” in the Preset Edit Menu, the currently selected preset is deleted immediately and the following presets are shifted up automatically.
fr: En choisissant "Delete" dans le Menu d'Édition des Préréglages", le préréglage sélectionné sera immédiatement supprimé et les préréglages suivant remonteront automatiquement dans la liste.

source: Configuration Menu
fr: Menu de Configuration

source: The configuration menu contains many settings that affect the instrument as a whole:
fr: Le Menu Configuration offre de nombreuses possibilités affectant l'ensemble de l'instrument :

source: **Coarse Tune** – shifts the tuning of all strings of the MidiGurdy up or down the given number of semitones.
fr: **Coarse Tune** – change l'accordage de toutes les cordes de la MidiGurdy en montant ou en descendant le nombre donné de demi-tons.

source: **Fine Tune** – shifts the tuning of all strings of the MidiGurdy up or down the given number of cents. The default tuning (Fine Tune = 0, Coarse Tune = 0) of the instrument with the supplied Soundfonts is A=440Hz.
fr: **Fine Tune** – change l'accordage de toutes les cordes de la MidiGurdy en montant ou en descendant le nombre donné de centièmes. L'accordage de l'instrument par défaut (Fine Tune = 0, Coarse Tune = 0) avec les Banques de Sons fournies est le "La 440Hz" (A=440Hz).

source: **Pitch Bend** – controls the amount of pitch bend in cent that you will hear when pressing a key harder or softer. Increase this value for more pitch bend, decrease it for less. 100 cent equal one semitone.
fr: **Pitch Bend** – contrôle la quantité en centième du "portamento" résultant de la pression plus ou moins forte exercée sur les touches. Monter la valeur pour plus de "pitch bend", la descendre pour moins d’effet. 100 centièmes correspondent à un demi-ton.

source: **Synth Gain** – Controls the amount of gain (amplification) used in the internal synthesizer. Depending on the sounds you have chosen for the strings and the volume of the samples in the Soundfont, you might have to increase the gain to reach the desired volume or decrease the gain to avoid digital distortion and clipping in the synthesizer.
fr: **Synth Gain** – contrôle la valeur du gain (amplification) utilisé dans le synthétiseur embarqué (interne). En fonction des sonorités choisies pour les cordes et le volumes des échantillons ("samples") dans la "Banque de Sons" (Soundfonts), il faudra régler le gain en augmentant ou diminuant sa valeur pour obtenir le volume adéquat afin d'éviter une distorsion digitale et / ou un écrêtage dans le synthétiseur.

source: **Keynoise…** - opens a menu similar to the String Menu where you can choose the sound of the key noise channel and change the volume and stereo balance of the key noise.
fr: **Keynoise…** - ouvre un menu semblable au Menu de Cordes, dans lequel il y a possibilité de choisir le canal affecté au "bruit des touches" et d’en changer le volume ainsi que la balance stéréo.

source: **MIDI…** - opens the MIDI configuration menu. Please see :ref:`midi` on how to configure the MIDI input and output.
fr: **MIDI...** - ouvre le menu de configuration MIDI. Voir :ref:`midi` pour savoir comment configurer l'entrée et la sortie MIDI.

source: **Brightness** – Controls the brightness of the display.
fr: **Brightness** – contrôle la luminosité de l'écran.

source: **Disp. Timeout** – Controls the number of seconds of inactivity after which the menu system will return to the Home Screen automatically.
fr: **Disp. Timeout** – contrôle le nombre de secondes d'inactivité après lesquelles le Menu Système basculera automatiquement sur l'Écran d'Accueil.
