Repository: midigurdy/mg-docs
Catalog: locales/*/LC_MESSAGES/Troubleshooting.po
Languages: fr

source: Troubleshooting
fr: Dépannages

source: If the instrument does not work as expected, please try to identify the problem by following the instructions below. If your problem is not listed or cannot be solved with the given hints, please use the support forum at https://forum.midigurdy.com or contact us directly.
fr: Si l'instrument ne fonctionne pas comme attendu, merci d'essayer d'identifier le problème en suivant les instructions ci-dessous. Si le problème rencontré n'est pas listé ou ne peut être résolu avec les conseils donnés, merci d'aller sur le forum d'assistance sur http://forum.midigurdy.com ou de nous contacter directement.

source: The instrument turns off for no apparent reason or sometimes doesn't start at all
fr: L'instrument s'éteint sans raison apparente ou ne démarre pas du tout

source: If you have a device plugged into the USB host port (maybe a USB stick or a USB-to-MIDI converter), remove the device and see if the problem persists.
fr: S'il y a un matériel branché sur le port hôte USB-A (peut-être une clé USB ou un convertisseur USB-vers-MIDI) retirer ce matériel et voir si le problème persiste.

source: **If you are powering the MidiGurdy only via the USB port:**
fr: **Si vous utilisez l'alimentation de la MidiGurdy uniquement par un port USB :**

source: Use a shorter USB cable and / or use a different USB port on the connected device.
fr: Utilisez un câble USB plus court et/ou utilisez un autre port USB sur le matériel connecté.

source: If using a phone charger as power supply via USB, use a different phone charger that can deliver more power.
fr: Si vous utilisez un chargeur de téléphone comme fournisseur d'énergie, utilisez un chargeur de téléphone différent et délivrant plus d'énergie.

source: Insert charged batteries into the instrument. The batteries can compensate for the current peaks if the connected device cannot supply enough current.
fr: Insérer des piles chargées dans l'instrument. Les piles peuvent compenser les pics d'alimentation si le matériel connecté ne peut pas fournir assez de courant.

source: Connect the supplied power supply
fr: Connecter le matériel d'alimentation (5V) fourni

source: **If you are powering the MidiGurdy via the 5V power supply:**
fr: **Si vous alimentez la MidiGurdy au moyen de l'adaptateur 5V :**

source: Check the polarity of the batteries
fr: Contrôlez la polarité des piles

source: Use a different power source, like USB or batteries. Maybe the power supply is faulty.
fr: Utilisez une source d'énergie différente. Il est possible que l'adaptateur soit défectueux.

source: **If you are powering the MidiGurdy only via batteries:**
fr: **Si vous alimentez la MidiGurdy seulement par piles :**

source: Replace the batteries with new or freshly charged ones
fr: Remplacez les piles avec des piles neuves ou récemment rechargées

source: The instrument does not produce any sound when turning the crank
fr: L'instrument ne produit aucun son quand on tourne la manivelle

source: Ensure that you have connected working headphones to the MidiGurdy headphone connector
fr: Assurez vous d'avoir connecté le casque audio sur le connecteur "casque audio" de la MidiGurdy

source: Make sure you have loaded a sound for at least one of the strings.
fr: Assurez vous d'avoir chargé un son pour au moins une corde.

source: Check the :ref:`main volume <volume-menus>` and the :ref:`string volume <common-string-items>`
fr: Contrôlez le :ref:`volume général <volume-menus>` et le :ref:`volume des cordes <common-string-items>`

source: My stereo headphones sound like they output two identical mono signals
fr: Mon casque "stéréo" émet comme deux signaux "mono" identiques

source: Turn the :ref:`balance of a sounding string <common-string-items>` to the far left or far right to check the stereo balance.
fr: Tournez la :ref:`balance <common-string-items>` complètement à droite ou à gauche pour vérifier la balance "stéréo".

source: Ensure that you are using a TRS-style connector (a headphone plug with only three sections on the plug). TRRS-style connectors (with four sections, as found on many headsets and headphones with microphones or volume controls) might not work as expected.
fr: Assurez vous que le connecteur utilisé est de type TRS (casque audio avec seulement trois sections sur la prise jack). Un connecteur de type TRRS ( quatre sections comme sur beaucoup d'écouteurs et de casques avec micros intégrés ou contrôles de volume) ne pourra pas fonctionner comme attendu.

source: If you are using a 3.5mm to 6.3mm adapter for your headphones, ensure that it is a stereo adapter and that it works as expected by testing it on another device.
fr: Si vous utilisez un adaptateur de prise 3,5 mm. à une prise 6,3 mm., assurez vous que l'adaptateur est bien "stéréophonique" et qu'il fonctionne tel quel sur un autre matériel de son.

source: I hear a lot of noise or humming when connecting the instrument to an external speaker or other sound device
fr: J'entends beaucoup de bruit ou un fort bourdonnement en branchant

source: Make sure you are using the supplied Y-cable and the breakout box to properly separate the MidiGurdy from the external device. See :ref:`other-sound-equipment` on how to connect the MidiGurdy to external sound devices.
fr: Assurez vous que vous utilisez bien le câble en "Y" et la "DI box" fournis pour séparer correctement la MidiGurdy du matériel externe. Voir :ref:`other-sound-equipment` pour savoir comment connecter le MidiGurdy à des appareils de son externes.

source: Check if the casing of the plug inserted into the headphone socket is made of metal and touches the front cover shielding the connectors. A connection between plug and front cover might lead to ground loops and a lot of noise in the output.
fr: Vérifiez si le boîtier de la fiche insérée dans la prise casque est en métal et touche le capot avant qui protège les connecteurs. Une connexion entre la fiche et le couvercle avant peut entraîner des boucles de masse et beaucoup de bruit dans la sortie.
